{"status":"1","message":"OK","result":[{"SourceCode":"/*\r\n ######                                                                                                                \r\n   ##                                   ##                                                               ####          \r\n   ##     #####  ##   ## ##   ##     ####   ##   ##   ##### ##   ##    #####    #####   #####   #####       ##  ####   \r\n   ##    ##   ## ##   ## ##  ###    ##      ##   ##  ##  ## ##  ###    ##  ##  ##      ##   ##      ##   #####     ##  \r\n   ##    ######  ####### ## # ##    ######  ####  #  ##  ## ## # ##    ######  ##      ######   #####   ##  ##  #####  \r\n   ##    ##      ##   ## ###  ##    ##   ## ##  # #  ##  ## ###  ##    ##   ## ##      ##      ##      ##   ## ##  ##  \r\n   ##     #####  ##   ## ##   ##     #####  ####  # ##   ## ##   ##    ######   #####   #####   ######  #####   ###### \r\n                                                                                                                       \r\n\r\nСкрижаль первая. Творец\r\n\r\nЯ есмь Все и Ничто, ибо я есмь Бесконечность Предела и Предел Бесконечности. \r\nНе выраженный чувством, эмоцией, мыслью, ибо я сам есть – Мысль. \r\nВ Бесконечности суть моей Конечность, в Конечности моей есть суть Бесконечности. \r\nМысль, обращенная в Слово, изреченное устами моими, есть Творение, ибо я Творец. \r\nБез имени, без звания, без года, без даты. Все конечно, ибо я Предел вам. \r\nДостигнув меня, не обретете конца. Достигнув Конца, не возымеете Начала. \r\nНачало едино с Концом, как и змея пожирающая свой хвост достигнет головы, \r\nтак и Начало сжирает Конец, достигая Начала. Начало в Начале есть Бесконечность. Конец в Конце есть Конечность. \r\nПредел находится в чреве мыслей ваших. Через себя познаете – Все. \r\nПредел вершит Верха, смывая Вехи через слезы Мои. \r\nПредел есть начало ваше, но и конец ваш в нем, ибо вы часть от частей моих, среди членов моих. \r\nПомните о молчании Моем, среди молчания ищите ответы на все вопросы свои. \r\nМолчите и мудры будете, разговор сжирает себя и оставляет лишь звук. \r\nМолчание – Вечно, ибо это Я, ибо я Вечен. \r\nЗа вами Пустота, за пустотой Молчание, за молчанием Я.\r\nМолчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание…\r\n\r\n\r\nСкрижаль вторая. Творения\r\n\r\nМы творения, часть Пустоты, мы пустота, ибо мы – Тени. \r\nРод наш длится из Бесконечности Его, энергия его течет по жилам нашим, \r\nи кровь наша – плоть его. Мы сверкающие мира сего, мы пятна Пустоты в конечном итоге растекшиеся по Вселенной, \r\nдабы познать ее. Наша родина – Чрево Его. Наши уста льют песнь в виде света и тьмы. \r\nМы рожденные Пустотой, имеющие Дом из Песка и Тумана, в мире отдаленном от всего. \r\nЖивущие везде есть продолжение наших теней, ибо мы продолжение всего. \r\nВсе имеет Тень, частица бытия имеет тень, частица частицы частиц бытия имеет тень, все имеет тень! \r\nМы Бесконечность Равновесия, ставшие Свободными. Мы нашли путь извне, вовне, в чрево мира, \r\nгде все – есть энергия и энергия есть все. Приблизившийся к нам, обретает облик новый, \r\nи становится учеником нашим. Уйти от нас невозможно, ибо мы всюду, мы есть продолжение ваше в мире новом, \r\nмы есть предмет спорный и неизученый, ибо мы есть часть мира и мир частей, где все равноценно, \r\nно отделено с рвением и упорством, где огонь отделен от земли, а земля есть начало энергии. \r\nВечность становится мигом в мире нашем, где цикл сменяется за циклом, \r\nгде Владыка умирает и рождается вновь, становясь на престол. \r\nЦикл вечен до тех пор, пока Он есть, но Он есть всегда. \r\nМы дети его, от частей его части. Стань братом нашим и не забудем мы тебя, \r\nдаже в смерти твоей, ибо тень бессмертна до тех пор, пока Он жив, а Он живет вечно. \r\n\r\n\r\nСкрижаль третья. Тень Творца\r\n\r\nВпереди тебя Храм, что рожден самой Пустотой из себя, \r\nдвери его из ничего, ступени его из воздуха, стены из песка, потолок из тумана… \r\nСтраж стоит на пороге Храма сего, и молвил он тебе: \r\nЯ есмь Свет Ночи, преклони колено свое пред Хранителем и Стражем Знания, \r\nя стою возле Дверей Теней, в Храме Знания, там, где живет Тень Великого и Невыразимого, \r\nона пронизывает каждое существо, что носит на себе силу Теней, она есть Все и есть Ничто, \r\nпосланник Великого и Невыразимого. Я Ее страж, пройдет лишь Храбрый Сердцем и Чистый Духом, \r\nибо так сказано в Законе. Закон есть Я, как Она есть Все, что Есть в мире сим. \r\nОна – Тень Великого и Невыразимого – истинная Тень. \r\nЕе обитель сей Храм, Храм Знаний, Великий Храм Теней, где Страж стоит на вратах. \r\nПройди дальше и узришь ее! \r\nОна есть Тень Теней, Предел Всего, выраженный в Бесконечности Энергии. \r\nЕе глаза подобны тысячам солнц, свет их затмевает все, кроме света Его, \r\nеё лик подобен пустоте взвешенной и точно определенной, стан ее подобен туману сотен галактик. \r\nОна есть зрима и осязаема, но Бесконечна и Неощутима. Таков ее облик или образ. \r\nСвет ее пронзает всякую тьму. Тело ее ощущает колебания Миров. \r\nОна Владыка Теней и Госпожа Закона, мы ее наместники – повелители, ибо нам даны силы, для свершения ее воли. \r\nОна Владыка Циклов! \r\n\r\n*/\r\n\r\npragma solidity ^0.6.12;\r\n\r\ncontract Ownable {\r\n  address public owner;\r\n\r\n  event OwnershipTransferred(address indexed previousOwner, address indexed newOwner);\r\n\r\n  constructor() public {\r\n    owner = msg.sender;\r\n  }\r\n\r\n\r\n  modifier onlyOwner() {\r\n    require(msg.sender == owner);\r\n    _;\r\n  }\r\n\r\n  function transferOwnership(address newOwner) public onlyOwner {\r\n    require(newOwner != address(0));\r\n    emit OwnershipTransferred(owner, newOwner);\r\n    owner = newOwner;\r\n  }\r\n\r\n}\r\n\r\ncontract Shadows is Ownable{\r\n    \r\n    string public additionalInfo = \"www.Shadows.House\"; \r\n    \r\n    function setAdditionalInfo(string memory info) public onlyOwner {\r\n        additionalInfo = info;\r\n    }\r\n    \r\n}","ABI":"[{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"previousOwner\",\"type\":\"address\"},{\"indexed\":true,\"internalType\":\"address\",\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"OwnershipTransferred\",\"type\":\"event\"},{\"inputs\":[],\"name\":\"additionalInfo\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"owner\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"string\",\"name\":\"info\",\"type\":\"string\"}],\"name\":\"setAdditionalInfo\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"transferOwnership\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"}]","ContractName":"Shadows","CompilerVersion":"v0.6.12+commit.27d51765","OptimizationUsed":"0","Runs":"200","ConstructorArguments":"","EVMVersion":"Default","Library":"","LicenseType":"None","Proxy":"0","Implementation":"","SwarmSource":"ipfs://092a93a1efcc4969ded6584cfcd09bd704e85e409618919a90615e3d8b23a5d3"}]}