{"status":"1","message":"OK","result":[{"SourceCode":"pragma solidity ^0.4.15;\r\n\r\n\r\n/**\r\n * @title Ownable\r\n * @dev The Ownable contract has an owner address, and provides basic authorization control\r\n * functions, this simplifies the implementation of \"user permissions\".\r\n */\r\ncontract Ownable {\r\n  address public owner;\r\n\r\n\r\n  event OwnershipTransferred(address indexed previousOwner, address indexed newOwner);\r\n\r\n\r\n  /**\r\n   * @dev The Ownable constructor sets the original `owner` of the contract to the sender\r\n   * account.\r\n   */\r\n  function Ownable() {\r\n    owner = msg.sender;\r\n  }\r\n\r\n\r\n  /**\r\n   * @dev Throws if called by any account other than the owner.\r\n   */\r\n  modifier onlyOwner() {\r\n    require(msg.sender == owner);\r\n    _;\r\n  }\r\n\r\n\r\n  /**\r\n   * @dev Allows the current owner to transfer control of the contract to a newOwner.\r\n   * @param newOwner The address to transfer ownership to.\r\n   */\r\n  function transferOwnership(address newOwner) onlyOwner public {\r\n    require(newOwner != address(0));\r\n    OwnershipTransferred(owner, newOwner);\r\n    owner = newOwner;\r\n  }\r\n\r\n}\r\n\r\n/**\r\n * @title Pausable\r\n * @dev Base contract which allows children to implement an emergency stop mechanism.\r\n */\r\ncontract Pausable is Ownable {\r\n  event Pause();\r\n  event Unpause();\r\n\r\n  bool public paused = false;\r\n\r\n\r\n  /**\r\n   * @dev Modifier to make a function callable only when the contract is not paused.\r\n   */\r\n  modifier whenNotPaused() {\r\n    require(!paused);\r\n    _;\r\n  }\r\n\r\n  /**\r\n   * @dev Modifier to make a function callable only when the contract is paused.\r\n   */\r\n  modifier whenPaused() {\r\n    require(paused);\r\n    _;\r\n  }\r\n\r\n  /**\r\n   * @dev called by the owner to pause, triggers stopped state\r\n   */\r\n  function pause() onlyOwner whenNotPaused public {\r\n    paused = true;\r\n    Pause();\r\n  }\r\n\r\n  /**\r\n   * @dev called by the owner to unpause, returns to normal state\r\n   */\r\n  function unpause() onlyOwner whenPaused public {\r\n    paused = false;\r\n    Unpause();\r\n  }\r\n}\r\n\r\n/**\r\n * @title SafeMath\r\n * @dev Math operations with safety checks that throw on error\r\n */\r\nlibrary SafeMath {\r\n  function mul(uint256 a, uint256 b) internal constant returns (uint256) {\r\n    uint256 c = a * b;\r\n    assert(a == 0 || c / a == b);\r\n    return c;\r\n  }\r\n\r\n  function div(uint256 a, uint256 b) internal constant returns (uint256) {\r\n    // assert(b > 0); // Solidity automatically throws when dividing by 0\r\n    uint256 c = a / b;\r\n    // assert(a == b * c + a % b); // There is no case in which this doesn't hold\r\n    return c;\r\n  }\r\n\r\n  function sub(uint256 a, uint256 b) internal constant returns (uint256) {\r\n    assert(b <= a);\r\n    return a - b;\r\n  }\r\n\r\n  function add(uint256 a, uint256 b) internal constant returns (uint256) {\r\n    uint256 c = a + b;\r\n    assert(c >= a);\r\n    return c;\r\n  }\r\n}\r\n\r\n/**\r\n * @title LifPresale\r\n * @dev Contract to raise a max amount of Ether before TGE\r\n *\r\n * The token rate is 11 Lif per Ether, if you send 10 Ethers you will\r\n * receive 110 Lifs after TGE ends\r\n * The contract is pausable and it starts in paused state\r\n */\r\n\r\n/**\r\n * TERMS AND CONDITIONS\r\n *\r\n * By sending Ether to this contract I agree to the following terms\r\n * and conditions:\r\n *\r\n\r\nSimple Agreement for Future Tokens\r\nThis Simple Agreement for Future Tokens (this “Agreement”) is entered into on between WT Limited (the “Company”) and (the “Buyer”) in connection with Company’s creation and distribution of the Líf blockchain token (“Project Token”) in furtherance of the establishment and operation of a B2B marketplace for travel inventory called Winding Tree, as described in the White Paper.\r\nPlease note that the agreement below only concerns the pre-sale token allocation and not the the Token Distribution Event, which will have its own rules, described in Exhibit A.\r\nNOW, THEREFORE, in consideration of the above, Company and Buyer hereby agree as follows:\r\nDefinitions\r\nDefinitions of Certain Terms. The terms defined in this section, whenever used in this Agreement (including in the Exhibits), shall have the respective meanings indicated below.\r\nAffiliate: with respect to any Person, any other Person directly or indirectly controlling, controlled by or under common control with such Person.\r\nBonus Rate: shall equal 10 percent (%).\r\nERC20: the Ethereum Request for Comment No. 20 smart contract standard setting the initial guidelines for a blockchain token that can be offered through, and available on, the Ethereum network in a standardized format in order to be tradable with other blockchain tokens on Ethereum (https://github.com/ethereum/EIPs/issues/20).\r\nETH: The blockchain token of Ethereum.\r\nEthereum: means the smart contract protocol, virtual machine and decentralized consensus mechanism including all its related components and protocol-related projects both present and future that is governed by the Ethereum Foundation based in Zug, Switzerland, which began operation (Genesis Block) on July 30th, 2015.\r\nGovernmental Authority: any nation or government, any state or other political subdivision thereof, any entity exercising legislative, judicial or administrative functions of or pertaining to government, including, without limitation, any governmental authority, agency, department, board, commission or instrumentality, and any court, tribunal or arbitrator(s) of competent jurisdiction, and any self-regulatory organization.\r\nIntellectual Property: all of the following in any jurisdiction throughout the world: (i) all inventions (whether patentable or unpatentable and whether or not reduced to practice), including without limitation the Project technology, all improvements thereto, and all patents, patent applications, and patent disclosures, together with all reissuances, continuations, divisions, continuations in-part, revisions, and extensions; (ii) all trademarks, service marks, trade names, trade dress, logos, business and product names, corporate names, Internet domain names, slogans, other source identifiers, together with all translations, adaptations, derivations, and combinations thereof and including all goodwill associated therewith, and all applications, registrations and renewals in connection therewith; (iii) all copyrightable works, all copyrights and all applications, registrations and renewals in connection therewith, and all moral rights (and similar non-assignable rights) and all benefits of waivers of moral rights (and similar non-assignable rights) therein; (iv) all trade secrets and confidential, technical and business information (including but not limited to ideas, research and development, algorithms, compositions, processes, designs, drawings, formulae, trade secrets, know-how, industrial models, business methods, technical data and information, engineering and technical drawings, product specifications and confidential business information); (v) mask work and other semiconductor chip rights and all applications, registrations and renewals in connection therewith; (vi) software; (vii) all other intellectual property and proprietary rights; and (viii) copies and tangible embodiments thereof (in whatever form or medium, including electronic media).\r\nLaws: laws, statutes, ordinances, rules, regulations, judgments, injunctions, orders and decrees.\r\nOrganizational Documents: the articles of incorporation, certificate of incorporation, charter, by-laws, articles of formation, certificate of formation, regulations, operating agreement, certificate of limited partnership, partnership agreement and all other similar documents, instruments or certificates executed, adopted or filed in connection with the creation, formation or organization of a Person, including any amendments thereto.\r\nPerson: an individual or legal entity or person, including a government or political subdivision or an agency or instrumentality thereof.\r\nProject: the blockchain-enabled network and/or decentralized consensus project being developed by Company that will utilize the Project Token as native to its operations and/or functioning.\r\nProject Founders: Maksim Izmaylov, Jakub Vysoky, Augusto Lemble, Pedro Anderson.\r\nProject Plan: the plan containing a detailed overview of major milestones to be achieved and approximate dates of execution and launch of the blockchain-enabled network of the Project.\r\nProject Token: Líf blockchain token, i.e. an ERC20 blockchain token created in connection with and native to the Project with the characteristics described in the Token Characteristics Document and distributed via (i) a Token Distribution Event and/or (ii) a methodology described in the Token Distribution Plan.\r\nProject Token Protocol: a blockchain based protocol aiming at providing a decentralized B2B marketplace for travel inventory called Winding Tree.\r\nPurchase Price: as defined in Section 2.\r\nTGE: Token Generating Event taking place on November 1st, 2017.\r\nToken Characteristics Document: attached hereto as Exhibit B.\r\nToken Distribution Event: the intended offering of Project Tokens to the general public or other specified investors as the case may be.\r\nToken Distribution Plan: attached hereto as Exhibit A.\r\nToken Price: price of one Project Token.\r\nWhite Paper: the technical document drafted and published by Company explaining the Project and its components, including the Project Plan and technical characteristics of the Project. Attached hereto as Exhibit C.\r\nPurchase, Sale and Distribution of Tokens\r\nOn the Token Distribution Event, Company shall deliver to Buyer a number of Project Tokens calculated by the following formula:\r\nx=Pt∗(1+b)\r\nwhere “x” is the number of tokens that the Buyer will receive after the Token Distribution Event, “P” is Purchase Price, “t” is Token Price (determined at the end of the Token Distribution Event) and “b” is Bonus Rate (e.g. 0.1 for 10%).\r\nExample: 100 ETH / 1 ETH * (1 + 0.1) = 110 tokens.\r\nUsage License\r\nOwnership of Project Tokens carries no rights, whether express or implied, other than a limited right (license) to use the Project Token Protocol, if and to the extent the Project Token Protocol has been successfully completed and launched.\r\nIn particular, Buyer understands and accepts that Project Tokens do not represent or constitute any ownership right or stake, share or security or equivalent rights nor any right to receive future revenues, shares or any other form of participation or governance right in or relating to the Project Token Protocol and/or the Project Tokens.\r\nBy transferring ETH to Company and/or receiving Project Tokens, no form of partnership, joint venture or any similar relationship between the Buyer and Company is created.\r\nRisks\r\nThe Buyer understands and accepts the risks in connection with making a Contribution to Company and creating Project Tokens. In particular, but not concluding, the Buyer understands the inherent risks listed hereinafter as well as in the Contribution Terms, which will be handed over to Buyer:\r\nRisk of software weaknesses: The Buyer understands and accepts that the Smart Contract System concept, the underlying software application and software platform (i.e. the Ethereum blockchain) is still in an early development stage and unproven, why there is no warranty that the process for creating Project Tokens will be uninterrupted or error-free and why there is an inherent risk that the software could contain weaknesses, vulnerabilities or bugs causing, inter alia, the complete loss of ETH and/or Project Tokens.\r\nRegulatory risk: The Buyer understands and accepts that the blockchain technology allows new forms of interaction and that it is possible that certain jurisdictions will apply existing regulations on, or introduce new regulations addressing, blockchain technology based applications, which may be contrary to the current setup of the Smart Contract System and which may, inter alia, result in substantial modifications of the Smart Contract System and/or the Project Token Protocol, including its termination and the loss of Project Tokens for the Buyer.\r\nRisk of abandonment / lack of success: The Buyer understands and accepts that the creation of the Project Tokens and the development of the Project Token Protocol may be abandoned for a number of reasons, including lack of interest from the public, lack of funding, lack of commercial success or prospects (e.g. caused by competing projects). The Buyer therefore understands that there is no assurance that, even if the Project Token Protocol is partially or fully developed and launched, the Buyer will receive any benefits through the Project Tokens held by him.\r\nRisk of withdrawing partners: The Buyer understands and accepts that the TGE and the feasibility of the Project as a whole depends strongly on the collaboration of banks and other crucial partners of Company. The Buyer therefore understands that there is no assurance that TGE will take place as foreseen or the Project as a whole will be successfully executed.\r\nRisk associated with other applications: The Buyer understands and accepts that the Project Token Protocol may give rise to other, alternative projects, promoted by unaffiliated third parties, under which Project Tokens will have no intrinsic value.\r\nRisk of loss of private key: Project Tokens can only be accessed by using an Ethereum Wallet with a combination of Buyer’s account information (address), private key and password. The private key is encrypted with a password. The Buyer understands and accepts that if his private key file or password respectively got lost or stolen, the obtained Project Tokens associated with the Buyer's account (address) or password will be unrecoverable and will be permanently lost.\r\nRisk of theft: The Buyer understands and accepts that the Smart Contract System concept, the underlying software application and software platform (i.e. the Ethereum blockchain) may be exposed to attacks by hackers or other individuals that could result in theft or loss of Project Tokens or ETH.\r\nRisk of Ethereum mining attacks: The Buyer understands and accepts that, as with other cryptocurrencies, the blockchain used for the Smart Contract System is susceptible to mining attacks, including but not limited to double-spend attacks, majority mining power attacks, “selfish-mining” attacks, and race condition attacks. Any successful attacks present a risk to the Smart Contract System, expected proper execution and sequencing of Project Token transactions, and expected proper execution and sequencing of contract computations.\r\nToken Liquidity. Buyer understands that with regard to Project Tokens no market liquidity may be guaranteed and that the value (if any) of Project Tokens over time may experience extreme volatility or depreciate resulting in full and total loss that will be borne exclusively by Buyer with respect to the Project Tokens Buyer purchases under this Agreement.\r\nRisk of incompatible Wallet service: The Buyer understands and accepts, that the Wallet or Wallet service provider used for the contribution, has to be technically compatible with the Project Token. The failure to assure this may have the result that Buyer will not gain access to his Project Token.\r\nLimited Warranties. Except as otherwise set forth herein, in the White Paper, Token Characteristics Document, and/or the Token Distribution Plan, Buyer understands and expressly accepts that there is no warranty whatsoever of the Project Token and/or the success of the Project, expressed or implied, to the extent permitted by law, and that Project Tokens will be created and delivered to Buyer at the sole risk of Buyer on an “as is” and “under development” basis and without, to the extent permitted by law, any warranties of any kind, including, but not limited to, express or implied warranties of merchantability or fitness for a particular purpose.\r\nLimitations on Recovery. Buyer understands that Buyer has no right against any Company or any other Person to request any refund or redemption of the Purchase Price except as otherwise provided herein and/or as a result of, or in connection with, Company’s breach of this Agreement, negligence or willful misconduct.\r\nRepresentation and Warranties of Company\r\nCompany hereby represents and warrants to Buyer, as of the date hereof, as follows:\r\nCorporate Status. The Company is a duly organized, validly existing and in good standing under the laws of British Virgin Islands and has all requisite corporate power and authority to carry on its business as now conducted.\r\nNo Conflict. To the extent that could be reasonably known to the Company, the execution, delivery and performance of this Agreement will not result in (i) any violation of, be in conflict with in any material respect, or constitute a material default under, with or without the passage of time or the giving of notice (A) any provision of Company’s Organizational Documents; (B) any provision of any judgment, decree or order to which Company is a party, by which it is bound, or to which any of its material assets are subject; (C) any material contract, obligation, or commitment to which Company is a party or by which it is bound; or (D) any Laws applicable to the Company that the Company is aware of or should be aware of acting reasonably, or (ii) the creation of any material lien, charge or encumbrance upon any material assets of the Company. The Buyer understands that the Project Tokens and Token Distribution Event may not be well defined under law. The Company has taken reasonable steps to ensure the legitimacy of its operations.\r\nIntellectual Property. Company has good and valid tile to all owned Intellectual Property. To the extent that could be reasonably known to the Company, the Company does not infringe, dilute, misappropriate or otherwise violate the rights of any third party in respect of any Intellectual Property. None of Company’s Intellectual Property is subject to any outstanding order, ruling, decree, judgment or stipulation by or with any court, tribunal, arbitrator or Governmental Authority.\r\nRepresentations and Warranties of Buyer\r\nBuyer hereby represents and warrants to Company, as of the date hereof, as follows:\r\nBuyer Power and Authority. Buyer has all requisite power and authority to execute, issue and deliver this Agreement and purchase the Project Tokens, and to carry out and perform its obligations under this Agreement and any related agreements. The Agreement constitutes a legal, valid and binding obligation of Company enforceable against Buyer in accordance with its terms.\r\nBuyer Status and Risk of Project. Buyer has sufficient knowledge and experience in business, financial matters to be able to evaluate the risks and merits of its purchase of the Project Tokens and is able to bear the risks thereof. Buyer understands that the Project and creation and distribution of the Project Tokens involve risks, including, but not limited to, the risk that (i) the technology associated with the Project will not function as intended; (i) the Project and Token Distribution Event will not be completed; (ii) the Project will fail to attract sufficient interest from key stakeholders; (iii) Company will fail to secure sufficient purchasers of Project Tokens; (iv) the Project Tokens may decrease in value over time and/or lose all monetary value; and (v) Company and/or the Project may be subject to investigation and punitive actions from Governmental Authorities.\r\nCorporate Status. If Buyer is a legal entity, Buyer is duly organized, validly existing and in good standing under the laws of its domicile and has all requisite corporate power and authority to carry on its business as now conducted.\r\nNo Ownership Interest. Buyer understands the purchase and potential receipt of Project Tokens do not involve the purchase of shares or any equivalent in any existing or future public or private company, corporation or other entity in any jurisdiction nor does it confer any voting rights, seats on any board of directors or governance rights and obligations to Buyer, except for the rights described in the Token Characteristics Document (Exhibit B).\r\nLimited Warranties. Except as otherwise set forth herein, in the White Paper, Token Characteristics Document, and/or the Token Distribution Plan, Buyer understands and expressly accepts that there is no warranty whatsoever of the Project Token and/or the success of the Project, expressed or implied, to the extent permitted by law, and that Project Tokens will be created and delivered to Buyer at the sole risk of Buyer on an “as is” and “under development” basis and without, to the extent permitted by law, any warranties of any kind, including, but not limited to, express or implied warranties of merchantability or fitness for a particular purpose.\r\nLimitations on Recovery. Buyer understands that Buyer has no right against any Company or any other Person to request any refund of the Purchase Price except as otherwise provided herein and/or as a result of, or in connection with, Company’s breach of this Agreement, negligence or willful misconduct.\r\nToken Liquidity. Buyer understands that with regard to Project Tokens no market liquidity may be guaranteed and that the value (if any) of Project Tokens over time may experience extreme volatility or depreciate resulting in full and total loss that will be borne exclusively by Buyer with respect to the Project Tokens Buyer purchases under this Agreement.\r\nSole Responsibility for Taxes. Buyer understands that Buyer bears sole responsibility for any taxes as a result of the matters and transactions the subject of this Agreement, and any future use, sale or other disposition of Project Tokens held by Buyer. To the extent permitted by law, Buyer agrees not to hold Company or any of its Affiliates, employees or agents (including developers, auditors, contractors or founders) liable for any taxes associated with or arising from Buyer’s purchase of Project Tokens hereunder, or the use or ownership of Project Tokens.\r\nCovenants\r\nFrom the date of this Agreement, Company may not permit the alteration of the Project Tokens to differ materially from the Token Characteristics Document other than upon the mutual written agreement of the parties.\r\nFrom the date of this Agreement, Company shall:\r\nprovide Buyer with periodic updates regarding the Project and the fulfilment of the Project Plan;\r\nto the extent practical and reasonable, follow best practices known in the blockchain industry for the development of tokens, smart contracts, decentralized consensus networks and blockchain technologies; and\r\nact diligently and perform a full independent security audit on any smart contracts or vanguard technologies employed by the Company in connection with the Project.\r\nConditions Precedent\r\nConditions to Obligations of Buyer. The obligations of Buyer to consummate the transaction contemplated hereby shall be subject to the fulfilment on or prior to the date of execution of this Agreement of the following conditions:\r\nCompany has provided Buyer with the White Paper for Buyer’s review and feedback.\r\nCompany has provided Buyer with the Token Characteristics Document.\r\nCompany has provided Buyer with the Token Distribution Plan, which describes the number of Project Tokens to be created and distributed by Company.\r\nIndemnification\r\nCompany shall defend, indemnify and hold harmless Buyer, its Affiliates and its officers, directors, employees, agents, successors and assigns (collectively, the “Buyer Indemnitees”) from and against, and pay or reimburse the Buyer Indemnitees for, any and all Losses resulting from (a) any inaccuracy in or breach of any representation or warranty when made or deemed made by Company in or pursuant to this Agreement, (b) any willful or negligent breach of or default in performance by Company under this Agreement or (c) any infringement, dilution, misappropriation, or violation of the rights of any third party in respect of any Intellectual Property where Company should have reasonably known that it was in breach of Intellectual Property of a third party.\r\nMiscellaneous\r\nGoverning Law. This Agreement shall be governed in all respects, including as to validity, interpretation and effect, by the laws of Switzerland, without giving effect to its principles or rules of conflict of laws, to the extent such principles or rules are not mandatorily applicable by statute and would permit or require the application of the laws of another jurisdiction.\r\nSuccessors and Assigns. This Agreement shall be binding upon and inure to the benefit of the parties, and their respective heirs, successors and permitted assigns. This Agreement shall not be assignable or otherwise transferable without the prior written consent of the other party, and any purported assignment in violation hereof shall be void.\r\nEntire Agreement. This Agreement constitutes the entire agreement between the parties and supersedes all prior or contemporaneous agreements and understandings, both written and oral, between the parties with respect to the subject matter hereof.\r\nSeverability. If any provision of this Agreement is determined by a court of competent jurisdiction to be invalid, inoperative or unenforceable for any reason, the parties shall negotiate in good faith to modify this Agreement so as to effect the original intent of the parties as closely as possible in an acceptable manner in order that the transactions contemplated hereby be consumed as originally contemplated to the fullest extent possible.\r\nCounterparts. This Agreement may be executed in several counterparts, each of which shall be deemed an original and all of which shall together constitute one and the same instrument.\r\nNo Partnership and No Agency. Nothing in this Agreement and no action taken by the parties pursuant to this Agreement shall constitute, or be deemed to constitute, a partnership, association, joint venture or other co-operative entity between any of the parties. Nothing in this Agreement and no action taken by the parties pursuant to this Agreement shall constitute, or be deemed to constitute, either party the agent of the other party for any purpose. No party has, pursuant to this Agreement, any authority or power to bind or to contract in the name of the other party.\r\nDispute Resolution.\r\nAll disputes arising out of or in connection with the present contract shall be finally settled under the Rules of Arbitration of the International Chamber of Commerce by one or more arbitrators appointed in accordance with the said Rules. Arbitration shall be conducted in Zurich. The number of arbitrators shall be [one/three]. Language of the proceedings shall be English.\r\nPublications and Notifications, Fees and Expenses. The parties shall agree to any press release or publication that jointly involves the names, brands or officers of both parties. Written correspondence and notifications between the Parties, whether as a result of a dispute or otherwise intended to be official correspondence, may be email or common forms of social media (Skype, Slack, WhatsApp). Each party shall be solely liable for all its own fees, costs and otherwise in connection with negotiation and execution of this Agreement and any future dealings between the parties and/or future publications regarding the parties.\r\nConfidentiality. This Agreement shall remain confidential between the parties in perpetuity, except to the extent required to be disclosed pursuant to applicable Laws and a one-time disclosure event to the general public. The content of the one-time public disclosure will be agreed to between the parties.\r\nTermination. This Agreement shall terminate on the Token Distribution Date, provided that Articles 9 and 10 of this Agreement shall survive any termination hereof.\r\n\r\n\r\n */\r\ncontract LifPresale is Ownable, Pausable {\r\n  using SafeMath for uint256;\r\n\r\n  // The address where all funds will be forwarded\r\n  address public wallet;\r\n\r\n  // The total amount of wei raised\r\n  uint256 public weiRaised;\r\n\r\n  // The maximun amount of wei to be raised\r\n  uint256 public maxCap;\r\n\r\n  /**\r\n     @dev Constructor. Creates the LifPresale contract\r\n     The contract can start with some wei already raised, it will\r\n     also have a maximun amount of wei to be raised and a wallet\r\n     address where all funds will be forwarded inmediatly.\r\n\r\n     @param _weiRaised see `weiRaised`\r\n     @param _maxCap see `maxCap`\r\n     @param _wallet see `wallet`\r\n   */\r\n  function LifPresale(uint256 _weiRaised, uint256 _maxCap, address _wallet) {\r\n    require(_weiRaised < _maxCap);\r\n\r\n    weiRaised = _weiRaised;\r\n    maxCap = _maxCap;\r\n    wallet = _wallet;\r\n    paused = true;\r\n  }\r\n\r\n  /**\r\n     @dev Fallback function that will be executed every time the contract\r\n     receives ether, the contract will accept ethers when is not paused and\r\n     when the amount sent plus the wei raised is not higher than the max cap.\r\n   */\r\n  function () whenNotPaused payable {\r\n    require(weiRaised.add(msg.value) <= maxCap);\r\n\r\n    weiRaised = weiRaised.add(msg.value);\r\n    wallet.transfer(msg.value);\r\n  }\r\n\r\n}","ABI":"[{\"constant\":true,\"inputs\":[],\"name\":\"maxCap\",\"outputs\":[{\"name\":\"\",\"type\":\"uint256\"}],\"payable\":false,\"type\":\"function\"},{\"constant\":false,\"inputs\":[],\"name\":\"unpause\",\"outputs\":[],\"payable\":false,\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"weiRaised\",\"outputs\":[{\"name\":\"\",\"type\":\"uint256\"}],\"payable\":false,\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"wallet\",\"outputs\":[{\"name\":\"\",\"type\":\"address\"}],\"payable\":false,\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"paused\",\"outputs\":[{\"name\":\"\",\"type\":\"bool\"}],\"payable\":false,\"type\":\"function\"},{\"constant\":false,\"inputs\":[],\"name\":\"pause\",\"outputs\":[],\"payable\":false,\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"owner\",\"outputs\":[{\"name\":\"\",\"type\":\"address\"}],\"payable\":false,\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"transferOwnership\",\"outputs\":[],\"payable\":false,\"type\":\"function\"},{\"inputs\":[{\"name\":\"_weiRaised\",\"type\":\"uint256\"},{\"name\":\"_maxCap\",\"type\":\"uint256\"},{\"name\":\"_wallet\",\"type\":\"address\"}],\"payable\":false,\"type\":\"constructor\"},{\"payable\":true,\"type\":\"fallback\"},{\"anonymous\":false,\"inputs\":[],\"name\":\"Pause\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[],\"name\":\"Unpause\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"name\":\"previousOwner\",\"type\":\"address\"},{\"indexed\":true,\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"OwnershipTransferred\",\"type\":\"event\"}]","ContractName":"LifPresale","CompilerVersion":"v0.4.15+commit.bbb8e64f","OptimizationUsed":"1","Runs":"200","ConstructorArguments":"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000005af3107a4000000000000000000000000000945158fc71586f4dd177d92cdcc4887c7c69ac36","Library":"","SwarmSource":"bzzr://11a98b93113bee473e9bea48a6cd939badede886b2222c949c3ca680f26a9d09"}]}