{"status":"1","message":"OK","result":[{"SourceCode":"pragma solidity ^0.4.17;\r\n\r\n// ----------------------------------------------------------------------------------------------\r\n// The Audax Legal Document Token - containing the Entropy Token Sale Terms.\r\n//\r\n// © Audax Legal Pty Limited 2017\r\n// This work is licensed under a Creative Commons\r\n// Attribution-NonCommercial-NoDerivatives 4.0\r\n// International License.\r\n//\r\n// These Terms are published by Entropy Foundation.\r\n// Entropy Token ToS 1.0\r\n//\r\n// An experiment in token and document persistence using the ethereum blockchain, and etherscan.io\r\n//\r\n// It's a lovely day to be solidity coding.\r\n// This contract adapted from work by Bok, originally working with Incent Coffee Tokens.\r\n// Adapted and extended by Peter, for the Hut34 Project - www.hut34.io\r\n//\r\n// Thanks and appreciation to bokconsulting.com.au\r\n// ----------------------------------------------------------------------------------------------\r\n\r\n/*\r\n\r\nENTROPY TOKEN SALE TERMS\r\nIf you pay us what we ask for,\r\nwe promise to assign a number of Entropy Tokens to your address,\r\nor return your unused payment to you.\r\nThese are the Terms.\r\n\r\nImportant Notice\r\n* Do not apply or pay for Entropy Tokens unless you fully understand what you are\r\npaying for and you accept the risks.\r\n\r\n* Before applying, please read Entropy Foundation’s current Token Disclosure\r\nStatement (TDS) for a summary of significant features and risks.\r\nNo disclosure document (including any white paper) can fully cover all features and\r\nrisks, so please carefully consider your situation before applying.\r\nEntropy Foundation’s current TDS is on Entropy Foundation’s Website and may be\r\nupdated from time to time.\r\n\r\n* The futures of HUT34, the Entropy Foundation and Entropy Token are highly\r\nspeculative.\r\nThere is no assurance of the future performance of any of them.\r\nParticipation in HUT34 and the Token Sale is targeted for developers. It is not\r\nsuitable for speculators or for financial investment.\r\n\r\n* These Terms are binding on the offer we make to you and on the sale of Entropy\r\nToken to you.\r\nNo other terms (whether written by you or us or implied) affect these Terms unless\r\nthey are mandatorily imposed by law and we cannot contract out of that.\r\n\r\n* You can only apply for Entropy Token through our Website.\r\nYou must accept and agree to be bound by these Terms for your participation in the\r\nToken Sale.\r\nNo-one other than Entropy Foundation is authorised to offer or to make\r\nstatements on behalf on behalf of Entropy Foundation. Guard against scams,\r\nphishing and hackers.\r\n\r\n* You are not offered any financial product, financial service or investment\r\nopportunity.\r\n\r\nDo not apply for Entropy Token for speculative financial gains.\r\n\r\nThere is no regulated disclosure document or token sale process applying to the\r\nToken Sale.\r\n\r\nIf any country’s laws prohibit or specifically regulate any part of the Token\r\nSale under financial or securities laws, then no offer or sale may occur under\r\nthe Token Sale as far as those laws actually apply.\r\nEntropy Foundation may cancel, limit, transfer or modify any step of the Token\r\nSale to ensure compliance with the Terms and any country’s laws.\r\n\r\nTerms\r\n1. Application of these Terms\r\n1.1 These terms (as amended from time to time – see clause 17.18) exclusively govern the legal\r\nrelationship between you (Applicant) and Entropy Foundation in the Token Sale. This includes\r\nreceiving, controlling and holding Entropy Tokens and your use of the Website, subject only to\r\nany law which cannot be excluded by these Terms.\r\n1.2 The Token Sale includes the offer made to you, your application, our decision whether to\r\naccept your application (in full or in part) and our completion of all accepted offers.\r\n1.3 If you participate in the Token Sale, you will be deemed to have conclusively and irrevocably\r\naccepted all of the Terms (without any counter-offer, amendment or ancillary agreements or\r\nterms asserted by you). You cannot counter-offer or change these Terms. If you do not agree\r\nto these Terms, then do not participate in the Token Sale.\r\n1.4 Entropy Foundation controls the Token Sale. No other person represents or binds Entropy\r\nFoundation in the Token Sale.\r\n2. Timing of Token Sale\r\n2.1 The Token Sale will begin at the Commencement Time and will end at the Closing Time. Those\r\ndates (and times) will be specified on the Website.\r\n2.2 Entropy Foundation may change the Commencement Time or the Closing Time in its absolute\r\ndiscretion. Any such changes will be notified on the Website and will be effectively immediately\r\nat the time of being published on the Website (without any other notice).\r\n2.3 Entropy Foundation may in its absolute discretion end the Token Sale and may withdraw any\r\noffers to allocate or to assign Entropy Tokens before the Closing Time (for clarity, without\r\nhaving to amend the Closing Time or to give notice to anyone).\r\n3. Website\r\n3.1 Entropy Foundation may, in its absolute discretion and without giving prior notice:\r\n(a) vary, modify, add or remove features, or amend any content on the Website; and\r\n(b) block or restrict access to, or terminate, withdraw or suspend use of, the Website or any\r\npart of the Website.\r\nThose changes apply to you whether or not you continue to access or to use the Website.\r\nNo Entropy Foundation Person will be liable for any Loss which is incurred as a result of such\r\naction.\r\n3.2 Entropy Foundation may remove any user generated content from the Website:\r\n(a) in its absolute discretion and without giving prior notice; and\r\n(b) at the request of a user.\r\n3.3 Entropy Foundation Persons are not responsible for, and will not be liable for, any user\r\ngenerated content posted to the Website. Entropy Foundation Persons will not be liable for any\r\nLoss arising from such content or from the failure of Entropy Foundation to moderate, delete or\r\ncorrect any such content.\r\n3.4 Entropy Foundation may arrange for the Website to accept registrations of interest in the Token\r\nSale. Any registration of interest is limited to a facility to advise registrants of the availability of\r\nthe Token Sale and to receive news and updates. It is not an application for Entropy Token and\r\ngives no right to allocations to Entropy Tokens. All registrants are solely responsible for taking\r\nthe steps to apply for Entropy Tokens as set out on the Website (in accordance with these\r\nTerms). (For clarity, such a facility to accept registrations of interest will be different from any\r\nfacilities for allocations prior to the public availability of the Token Sale.)\r\n3.5 The Website may contain hyperlinks to websites which are not maintained or controlled by\r\nEntropy Foundation. All hyperlinks to such websites are provided as a convenience to you.\r\nUse of the hyperlinks and access to such websites is entirely at your own risk. No Entropy\r\nFoundation Person is responsible for any third-party content contained in websites linked to the\r\nWebsite. No Entropy Foundation Person is liable for any Loss arising from accessing, using or\r\nrelying on such websites.\r\n3.6 The inclusion of any hyperlink does not imply endorsement by Entropy Foundation of such\r\nwebsites. Entropy Foundation is not the partner, associate, agent or other representative of any\r\nperson who is named on the Website or whose trademark, service marks, logo, insignia or other\r\ndevice is used on or appears on websites to which the Website is linked.\r\n4. Token Sale\r\n4.1 Applicant must apply to buy Entropy Tokens only through the Website.\r\n4.2 By applying for Entropy Token through the Website, Applicant irrevocably agrees to these\r\nTerms (as may be amended after their application in accordance with these Terms).\r\n4.3 All applications for Entropy Token are irrevocable. They may not be withdrawn prior to the end\r\nof the Token Sale with the express written consent of Entropy Foundation notified to Applicant.\r\n4.4 Any applications which are not allocated in full or in part as at the end of the Token Sale\r\nautomatically lapse.\r\n4.5 Entropy Foundation may terminate the Token Sale at any time, without notice, and regardless of\r\nthe amount of Entropy Tokens allocated.\r\n4.6 Applicant’s application to buy Entropy Tokens is subject to Entropy Foundation’s sole discretion\r\nto accept the application, in whole or in part.\r\n4.7 Entropy Foundation will comply with all express written representations it makes on its Website\r\nabout the Token Sale. This includes, but is not limited to, caps on issuance, pricing and\r\nallocation of Entropy Tokens.\r\n4.8 The TDS does not provide any representation, warranty, undertaking, assurance or give rise to\r\nany other conduct (or omission) which affects these Terms or which independently gives any\r\nperson any legal rights or expectations.\r\n4.9 The fixed limit on the total number of Entropy Tokens is 100,000,000 Entropy Tokens. The limit\r\nthat will be generated will be referenced in the smart contract code for the Entropy Token. (see\r\nclause 9.1.)\r\n4.10 Applicant must pay Entropy Foundation for the number of Entropy Tokens applied for at the\r\nprice offered by Entropy Foundation and in the forms (including digicurrencies or fiat currencies)\r\nnotified on the Website. The offered price (as notified on the Website) may differ according to\r\nthe timing of applications and the number of Entropy Tokens applied for. Entropy Foundation\r\ndecides how to apply the pricing which is stated on the Website from time to time.\r\n4.11 Applicant acknowledges that failure to follow the Token Sale instructions on the Website or any\r\ndifficulties in transferring payment may limit, delay, or prevent Applicant from applying for and\r\nacquiring Entropy Tokens. Any questions about such instructions should be directed to\r\nadmin@hut34.io.\r\n4.12 Entropy Foundation will pay Applicant, or return to the control of Applicant (as the case may be)\r\nany amount of payment or other consideration which is in excess of the amount required to\r\nsettle Applicant’s payment obligation to acquire Entropy Tokens allocated to Applicant.\r\nApplicant accepts that there may be delays or procedural issues in arranging payment to\r\nApplicant due to third party systems (such as digicurrency exchanges or e-wallets).\r\n4.13 There is no cooling off period on or after allocation of the Entropy Tokens to Applicant.\r\n4.14 Allocation of Entropy Tokens to Applicant is irreversible and irrevocable. There is no refund or\r\ncompensation to Applicant for the number (if any) of Entropy Tokens allocated (or not allocated)\r\nto Applicant.\r\n4.15 Allocations of Entropy Tokens to Applicant will only be made in accordance with the details\r\nprovided by Applicant.\r\n4.16 The only official and authorised Token Sale website URL operated by Entropy Foundation is\r\nhttps://hut34.io/entropySale Applicant is solely responsible for ensuring that the URL of their\r\nweb browser indicates that it is using a hypertext transport protocol secure connection (“https”)\r\nand that the domain name used by them is correct.\r\n4.17 Entropy Foundation does not support or endorse any third party website or service which\r\naccepts payment in relation to Entropy Tokens, provides Entropy Tokens during the Token Sale\r\nor facilitates either of these things in any way during the Token Sale or at any time up to the\r\nlaunch of HUT34. Entropy Foundation has no relationship in any way with such other parties or\r\nservices. Applicants are urged not to use any third party service which claims to offer such\r\nservices.\r\n4.18 By participating in the Token Sale or receiving, controlling and holding Entropy Tokens, to the\r\nextent permitted by applicable law, you agree that no other party (including, without limitation\r\nany Entropy Foundation Person) may be held liable for any Loss arising out of, or in any way\r\nconnected to, your participation in the Token Sale or receiving, controlling and holding Entropy\r\nTokens in any manner other than via the Website.\r\n4.19 By applying for and being allocated Entropy Tokens, to the extent permitted by applicable law\r\nyou may not hold any Entropy Foundation Person liable for any Loss arising out of, or in any\r\nway connected to, your failure to secure properly and to keep private your email address and\r\nany password or private key used in connection with the Token Sale. Applicant accepts the risk\r\nthat if Applicant does not maintain an accurate record of these, then Applicant will lose control\r\nover or access to Entropy Tokens (without any compensation for that or any allocation or\r\ntransfer of substitute Entropy Tokens).\r\n4.20 Entropy Foundation may arrange for offers, invitations and allocations of Entropy Tokens before\r\nor during the Token Sale. Nothing in these Terms limits or prevents Entropy Foundation from\r\nallocating Entropy Tokens, at different prices, and on different terms from these Terms.\r\n5. Creation of Entropy Tokens\r\n5.1 Entropy Tokens will be assigned to successful Applicants within 14 days after the day of the\r\nClosing Time. (This period allows for reconciliation of applications and payments, resolving\r\npayment details and for integrity reviews.)\r\n5.2 For the purposes of the Token Sale, all Entropy Tokens assigned as a result of the Token Sale\r\nwill be publicly viewable at the Etherscan.io website (subject to continued maintenance of that\r\nwebsite by its owner).\r\n6. Main purposes of Token Sale\r\n6.1 The two main purposes of the Token Sale are to generate Entropy Tokens to be used in HUT34\r\nand to receive payment for the assignment of those Entropy Tokens sold in the Token Sale.\r\n6.2 The payment or other consideration received by Entropy Foundation for the assignment of\r\nEntropy Tokens will be applied in its absolute discretion towards the development and\r\nmarketing of HUT34 and for general expenses of Entropy Foundation. No representation,\r\nundertaking or assurance is given as to precise use or the timing of use of the consideration\r\nreceived by Entropy Foundation for assigning Entropy Tokens.\r\n6.3 Entropy Tokens carry no right to or other legal interest in Entropy Foundation, Hut34 or the right\r\nto control or to be compensated for any decision by Entropy Foundation with respect to its\r\nbusiness, its use of its funds or its decisions if and how to develop Hut34.\r\n7. Obligations of Applicant for Token Sale\r\n7.1 Applicant is solely responsible for determining if they can legally participate in the Token Sale\r\nand receive and hold Entropy Tokens, including but not limited to whether Applicant’s\r\nparticipation in the Token Sale is subject to the laws of Applicant’s jurisdiction or other laws\r\napplying to Applicant. No refund or other compensation will be given if Applicant or an Entropy\r\nToken Owner later claims they were not entitled to, or were prohibited from, participating in the\r\nToken Sale, including but not limited to applying for, being assigned or acquiring control over\r\nEntropy Tokens. The contract for allocating Entropy Tokens will not be fundamentally breached\r\nby any such asserted legal incapacity.\r\n7.2 Applicant is solely responsible for ensuring the validity of all of their blockchain payments to\r\nEntropy Foundation in the Token Sale.\r\n7.3 Applicant is solely responsible for assessing the risks of participating in the Token Sale, HUT34,\r\nEntropy Tokens and the role of Entropy Foundation.\r\n(a) Applicant must make that assessment without relying on any version of any Whitepaper\r\nor TDS. While Entropy Foundation publishes Whitepapers, TDSs and other documents\r\nfrom time to time, those documents are not represented as, and may not be taken as,\r\nbeing complete or exhaustive in disclosing features and risks of Entropy Tokens and\r\nHUT34 nor can they reasonably be expected to remain current, especially due to HUT34\r\nundergoing development in volatile conditions.\r\n(b) Applicant and each other Entropy Token Owner accepts and acknowledges that any\r\npublications by or on behalf of Entropy Foundation may not be relied upon as\r\nrepresentations, undertakings, assurances or guarantees nor as partial or complete\r\ndisclosures of features and risks of the Token Sale, HUT34, Entropy Tokens and Entropy\r\nFoundation.\r\n(c) Applicant and each other Entropy Token Owner is solely responsible for assessing the\r\nfeatures and risks of acquiring Entropy Tokens (independently of, and without any\r\nreliance on, any TDS or Whitepaper).\r\n7.4 Applicant is solely responsible for ensuring Applicant complies with these Terms and any\r\nsupplemental instructions given by Entropy Foundation.\r\n7.5 Applicant is solely responsible for complying with any requests made by Entropy Foundation to\r\nApplicant to complete or process any application.\r\n8. Acceptance of these Terms for the Token Sale\r\n8.1 By using the Website and participating in the Token Sale you represent and warrant that\r\nyou:\r\n(a) are legally permitted to participate in the Token Sale and receive, control and hold\r\nEntropy Tokens in your jurisdiction and otherwise subject to laws applying to you;\r\n(b) are of a sufficient age to be bound by these Terms and to participate in the Token Sale\r\nand receive, control and hold Entropy Tokens;\r\n(c) are not participating in the Token Sale, and not planning to receive, control or hold\r\nEntropy Tokens, or exchanging any digicurrency for Entropy Tokens, for the purpose of\r\nfinancial investment;\r\n(d) are not participating in the Token Sale, and not planning to receive, control or hold\r\nEntropy Tokens or exchanging any digicurrency for an illegal purpose;\r\n(e) are not participating in the Token Sale, and not planning to receive, control or hold\r\nEntropy Tokens or exchanging any digicurrency for or on behalf of a government agency\r\nor regulator without prior express written disclosure of that to Entropy Foundation; and\r\n(f) have a reasonable understanding of the usage, features, complexity and risks of\r\nBlockchain-token Technology, sufficient to be solely responsible for assessing the Token\r\nSale, these Terms and the nature and prospective use of Entropy Tokens and HUT34.\r\n8.2 Further, by using the Website and participating in the Token Sale you acknowledge and agree\r\nthat:\r\n(a) you represent that you are participating in the Token Sale and are planning to receive,\r\ncontrol and hold Entropy Tokens to facilitate the development, testing, deployment and\r\noperation of HUT34;\r\n(b) you take sole responsibility for any restrictions and risks associated with participating in\r\nthe Token Sale or receiving, controlling and holding Entropy Tokens, whether referred to\r\nin these Terms, arising under any applicable law or otherwise;\r\n(c) if you are acquiring Entropy Tokens on behalf of another person, you accept these Terms\r\non behalf of that other person, and you represent and warrant that you and the other\r\nperson will be responsible for any breach of these Terms and for any liability of Applicant\r\narising under these Terms;\r\n(d) to the extent permissible by law, you waive the right to participate in any class action\r\nlawsuit or any class wide arbitration against any Entropy Foundation Person for any Loss\r\nor other matter arising out of the Token Sale;\r\n(e) the proposed outcomes mentioned or referred to in Token Sale Documents might not be\r\nachieved in full or in part, and can and should be expected to develop in ways and in\r\ndetails which cannot reasonably be foreseen at the time of the Token Sale;\r\n(f) participating in the Token Sale and receiving, controlling and holding Entropy Tokens do\r\nnot grant any decision making power, including (without limitation) in relation to\r\ndevelopment, governance or the role, conduct or performance of Entropy Foundation or\r\nHUT34;\r\n(g) you must not hack into, interfere with, disrupt, disable, overburden or otherwise impair the\r\nproper working of the Website;\r\n(h) you must not violate or attempt to violate the security of the Website;\r\n(i) you must not access information or data which you are not authorised to access;\r\n(j) you must promptly provide to Entropy Foundation upon request any additional information\r\nwhich Entropy Foundation or any other Entropy Foundation Person considers necessary\r\nor prudent for the proper conduct of the Token Sale; and\r\n(k) you must ensure that any information or content posted, or permitted or caused to be\r\nposted, on the Website other than details for the application, is non-confidential or nonproprietary\r\nunless expressly indicated otherwise, and not offensive, illegal under any\r\napplicable law, and that you will be responsible for all such information or content.\r\n8.3 By participating in the Token Sale and by receiving, controlling or holding Entropy Tokens, you\r\nacknowledge and agree that you fully understand that, and take the risks arising from, Entropy\r\nTokens can experience volatility in pricing or liquidity and that, to the extent permitted by\r\napplicable law, you agree that no other party (including, without limitation any Entropy\r\nFoundation Person) may be held liable for any Loss arising out of, or in any way connected to\r\nyour participation in the Token Sale or receiving, controlling and holding Entropy Tokens except\r\nas expressly set out in these Terms and limited to the extent expressly set out in these Terms.\r\n9. Representations and acknowledgements about Entropy Tokens and\r\nHUT34\r\n9.1 Entropy Tokens will be ERC20 compliant Ethereum tokens as published on the Ethereum\r\nblockchain. For the purposes of the Token Sale this will be published to the Etherscan.io\r\nwebsite. No other feature, representation or undertaking is made or implied about Entropy\r\nTokens or HUT34 which is inconsistent with those features of Entropy Tokens.\r\n9.2 For the purposes of the Token Sale and developing HUT34 for Entropy Tokens, Entropy\r\nFoundation will not recognise any Entropy Token Owner (other than, for the Token Sale,\r\nApplicant), any nominee or any other indirect interest in an Entropy Token; however, Entropy\r\nFoundation may act on information or reasonable belief as to persons controlling (or reasonably\r\nlikely to control) Entropy Tokens for the purposes of Entropy Foundation complying with\r\nregulatory and taxation obligations that arise from time to time.\r\n9.3 Entropy Token Owners, whether by virtue of their control or ownership of Entropy Tokens or\r\notherwise:\r\n(a) do not acquire any legal right to control those Entropy Tokens which are assigned to\r\nthem (also referred to as being delivered to them) since the Ethereum token technology\r\ncontrols the assignment;\r\n(b) acknowledge that Entropy Tokens have only such functionality as provided for inherently\r\nin the features of the Entropy Token, have no inherent value and that there is no\r\nrepresentation or assurance as to how they will function or could have value in HUT34 or\r\noutside of HUT34;\r\n(c) do not have any share in, partnership for or other right of any kind to Entropy Foundation\r\nor to any part of HUT34 or to any profits, dividends or other distributions from either of\r\nthem (and acknowledge that HUT343 is not a separate legal entity, trust, partnership,\r\njoint venture, investment scheme or financial service or product);\r\n(d) do not have any ownership right to, stake in, share of, or analogous or supplementary\r\nrights to receive future revenue shares, profit shares, intellectual property rights or any\r\nother form of participation in or relating to HUT34 or Entropy Foundation;\r\n(e) are not in joint venture with, agents or partners of, or co-investing with Entropy\r\nFoundation, any other Entropy Foundation Person or with any other Entropy Token\r\nOwners from time to time;\r\n(f) have no assured or express rights to, or rights to access, or participation in, HUT34;\r\n(g) will not have any rights to influence the business of or governance of Entropy Foundation;\r\nand\r\n(h) will not have any rights to influence the development or governance of HUT34.\r\n9.4 There are no representations, undertakings or assurances that HUT34 will be delivered within\r\nany particular timeframe, or at all, or with any particular features, functions or outcomes.\r\n9.5 No Entropy Foundation Person owes any fiduciary duty to any Applicant, any other Entropy\r\nToken Owner or to any person claiming through any of them.\r\n9.6 Entropy Foundation Persons and persons associated with any of them may receive Entropy\r\nTokens during and after the Token Sale (and at prices or on other terms that differ from those\r\nthat apply to the Token Sale).\r\n9.7 No representation or warranty is given as the fitness for purpose of Entropy Tokens or HUT34\r\nor for their nature other than as expressly provided for in these Terms.\r\n9.8 All implied or express representations, warranties, undertakings, assurances and forward\r\nlooking statements and opinions about Entropy Tokens and the Token Sale by or on behalf of\r\nany Entropy Foundation Person are excluded to the extent permissible by law.\r\n9.9 Subject to any law which mandatorily applies to these Terms and cannot be excluded by these\r\nTerms, no Entropy Foundation Person is liable (including in contract, by tort, by reason of\r\nfiduciary duties or otherwise) for any Loss suffered by Applicant or other Entropy Token Owner\r\ndirectly or indirectly arising out of, or in any way connected to, the nature of Entropy Tokens or\r\nHUT34.\r\n10. Taxation\r\n10.1 Entropy Foundation makes no representation about the tax implications of participating in the\r\nToken Sale or receiving, controlling and holding Entropy Tokens.\r\n10.2 You bear the sole responsibility for determining or assessing the tax implications of your\r\nparticipation in the Token Sale or receiving, controlling and holding Entropy Tokens in all\r\nrespects and in any jurisdiction relevant to you.\r\n10.3 By participating in the Token Sale or receiving, controlling and holding Entropy Tokens, to the\r\nextent permitted by applicable law, you agree that no other party (including, without limitation\r\nany Entropy Foundation Person) is liable for any Loss arising out of, or in any way connected to,\r\nany tax liability you may incur in connection with your participation in the Token Sale or\r\nreceiving, controlling and holding Entropy Tokens.\r\n11. Intellectual Property\r\n11.1 Unless otherwise stated on the Website, or if its manifestly evident that content is user\r\ngenerated content, the content and information on the Website are the property of or under the\r\nexclusive control of Entropy Foundation.\r\n11.2 You may not download, reproduce, or retransmit any information, other than for non-commercial\r\nand personal use.\r\n11.3 The Website may be used by Applicant only for the purpose of Applicant’s application.\r\n11.4 You, Applicant, are granted a limited, non-transferable, revocable licence to view and to copy\r\nthe information solely for personal use only, subject to clause 11.5.\r\n11.5 All intellectual property rights comprised in the information, text, graphics, logos, images, audio\r\nclips, data compilations, scripts, software, technology, sound or any other materials or works in\r\nthe Website, except for content which is user generated content, vests in and remains the\r\nproperty of Entropy Foundation or, the extent it is not recognised at law as being property, is\r\nunder the exclusive control of Entropy Foundation. You are permitted to download and to print\r\nsuch materials from the Website for personal and non-commercial use subject to these Terms\r\nand to Entropy Foundation’s policies as published on its Website from time to time.\r\n12. Laws and regulations applying to Token Sale and citizens\r\n12.1 The agreement is governed by and must be construed in accordance with the laws in force in\r\nNew South Wales.\r\n12.2 The parties submit to the non-exclusive jurisdiction of the courts operating in New South Wales.\r\n12.3 Applicant and each other Entropy Token Owner acknowledges and accepts the risk of laws of\r\nany jurisdiction, in relation to the Token Sale, these Terms, Entropy Token and HUT 34:\r\n(a) applying to the Token Sale or their Entropy Tokens or their participation in Hut34 despite\r\nthe expressly agreed governing law of these Terms;\r\n(b) later changing, being announced but not enacted;\r\n(c) being interpreted or administered by any government authority without enactment of\r\nthose interpretations or administration;\r\n(d) the laws, or their interpretation or policy for administering them, being uncertain, or\r\nbecoming uncertain, volatile or inconsistent from time to time; and\r\n(e) despite the expressly agreed governing law of these Terms, may be asserted by a court\r\nor government authority in jurisdictions outside of Australia to purport to apply to, or have\r\njurisdiction, over the Token Sale, these Terms, Entropy Token and HUT 34.\r\n12.4 Entropy Foundation will apply limits, rules, controls and procedures and require such\r\ninformation from Applicant which it decides in its absolute discretion are required or reasonable\r\nin order to ensure compliance by Entropy Foundation, Applicants and other Entropy Token\r\nOwners with the laws of any jurisdiction which Entropy Foundation is aware actually applies.\r\n12.5 Nothing in these Terms or in the conduct or omissions by any Entropy Foundation Person may\r\nbe construed as implying legal advice by any Entropy Foundation Person, any regulatory\r\napproval or any acceptance by any Entropy Foundation Person of the legal capacity of\r\nApplicant or other Entropy Token Owner to participate in the Token Sale or to be assigned\r\nEntropy Tokens.\r\n12.6 No Entropy Foundation Person is obliged to ensure Applicant or other Entropy Token Owner\r\ncomplies with the laws applying to them.\r\n12.7 Entropy Foundation will co-operate with all notices, demands and enquiries from government or\r\nlaw enforcement authorities which it reasonably determines are mandatory and all court-issued\r\nsubpoena provided they are fully supported and documented by the law in the relevant\r\njurisdiction or which Entropy Foundation otherwise determines it is obliged to comply with or it is\r\nin the long-term interests of HUT34 to comply with.\r\n12.8 Applicant and other Entropy Token Owners accept that Entropy Foundation may be required to\r\ndisclose personal information held by or for Entropy Foundation acquired by it or disclosed to it\r\nthrough the Token Sale.\r\n12.9 We will not incur any liability to Applicant for any Loss which Applicant suffers (including\r\nconsequential loss) however that is caused to the extent attributable to any action taken or not\r\ntaken by us as contemplated in these Terms.\r\n13. Applicant’s warranties and undertakings\r\n13.1 Applicant warrants and, if applicable to the obligation below, undertakes that:\r\n(a) Applicant has the power to enter into and to perform an agreement made pursuant to\r\nthese Terms.\r\n(b) Applicant is not under any legal impediment or other impairment which makes, or could\r\nmake, an agreement made pursuant to these Terms void, voidable or unenforceable.\r\n(c) Applicant is not insolvent, under any form of external administration nor has Applicant\r\nagreed to make a settlement with, assignment to, or compromise with its creditors.\r\n(d) All of the statements made by Applicant to Entropy Foundation, or otherwise for the\r\npurposes of applying in the Token Sale, are true and correct and not misleading or\r\ndeceptive.\r\n(e) Applicant will not rely on any Token Sale Document for deciding whether to acquire\r\nEntropy Tokens or deciding whether to participate in the Token Sale.\r\n(f) Applicant has had a reasonable opportunity to obtain all advisable or necessary\r\nindependent advice for the purpose of deciding whether to participate in the Token Sale.\r\n13.2 Applicant expressly confirms for the benefit of Entropy Foundation and each other Entropy\r\nFoundation Person that Applicant is participating in the Token Sale and will be assigned, control\r\nand hold Entropy Tokens at their own legal, financial and business risk and that Entropy Tokens\r\nare provided on an “as is” basis without any warranties, representations or opinions of any kind,\r\nwhether express or implied, including, but not limited to, warranties of title or implied warranties,\r\nmerchantability or fitness for a particular purpose except only to the extent expressly stated in\r\nthe Terms or as imposed by law and which may not by these Terms be modified, limited or\r\nexcluded\r\n13.3 Without limiting clause 13.2, no Entropy Foundation Person warrants or undertakes that the\r\nprocess for participating in the Token Sale or being assigned or controlling and holding Entropy\r\nTokens will be uninterrupted or error-free.\r\n13.4 Applicant expressly confirms for the benefit of Entropy Foundation and each other Entropy\r\nFoundation Person that each Entropy Foundation Person may rely on these Terms and\r\nApplicant’s acceptance of these Terms as confirmation that each Entropy Foundation Person\r\nother than Entropy Foundation may also rely on these Terms as a complete bar to any\r\nproceedings by or in the name of Applicant (or another Entropy Token Owner) to the extent\r\nthose proceedings assert or rely on the claim that the Entropy Foundation Person does not\r\nhave the benefit of these Terms by reason of not being a party to any agreement by Applicant\r\nmade pursuant to or in relation to these Terms or due to not being expressly named in these\r\nTerms (or both).\r\n14. Disclaimers, exclusions and limitations of liability\r\n14.1 To the extent Token Sale Documents include forward-looking statements or other statements\r\nthat appear to make a statement about future conduct or performance:\r\n(a) Entropy Foundation expressly excludes making any promise, undertaking or guarantee\r\nas to future performance of Entropy Tokens, Entropy Foundation, Hut34 or anything else\r\nunless expressly stated in these Terms or on the Website in relation to the Token Sale.\r\n(b) You must not place any reliance on such forward-looking statements. Do not make any\r\ndecision whether to participate in the Token Sale in reliance on any forward looking\r\nstatement.\r\n14.2 By participating in the Token Sale, and being assigned and controlling and holding Entropy\r\nTokens, or using the Website, Entropy Foundation and each other Entropy Foundation Person\r\nrelies on your acknowledgement, for the benefit of all of them, that you acknowledge and agree\r\nthat you fully understand and accept the features and risks of participating in the Token Sale,\r\nand that no sale or disclosure document could substitute for your own assessment and\r\nacceptance of those risks.\r\n14.3 Preserved Liability means:\r\n(a) any liability which by law may not be excluded, limited or qualified; and\r\n(b) any liability, or duty for which we are liable, specified in these Terms which we have\r\nexpressly agreed may not be excluded, limited or qualified.\r\n14.4 Subject to a Preserved Liability and except if directly due to our breach of law, negligence, wilful\r\ndefault of these Terms or our dishonesty, to the extent permitted by law, we are not liable to\r\nApplicant or to any other Entropy Token Owner for the following:\r\n(a) your participation in the Token Sale, providing funds to Entropy Foundation or receiving,\r\ncontrolling and holding Entropy Tokens;\r\n(b) any access, the use of, or inability to access or use, the Website;\r\n(c) your reliance on or use or inability to use the content and information of the Website or\r\nany linked website;\r\n(d) any failure of performance, error, omission, interruption, defect, delay in operation or\r\ntransmission, computer virus or communications line or system failure of the Website or\r\nany linked website;\r\n(e) unauthorised access to or alteration of your transmissions or data;\r\n(f) statements or conduct of any third party on the Website;\r\n(g) any other matter relating to the Website;\r\n(h) our acts or omissions in reliance on Applicant’s representations, warranties,\r\nacknowledgments, confirmations and obligations under these Terms, Applicant’s\r\ninstructions or any other information we have relied upon provided by Applicant including\r\nby Applicant’s authorised representative, agent or other representative;\r\n(i) events or circumstances beyond our reasonable control, including (without limitation) acts\r\nof agents and other service providers used by us to perform our obligations under these\r\nTerms, currency restrictions, disruption of the normal services by others, liquidation or\r\ninsolvency by persons who are not Associates of Entropy Foundation, acts of government\r\nor their agencies, acts of war or terrorism, riots, revolution or other similar events or acts;\r\n(j) an act or omission required by law or by a court of competent jurisdiction;\r\n(k) any actual or asserted fiduciary duty which is not expressly stated in these Terms;\r\n(l) any payment owing by Applicant or other Entropy Token Owner to a fiscal authority,\r\nincluding but not limited to any taxes, levies, stamp duty or government charges;\r\n(m) any act or omission of an operator of a payment, funds or digicurrency system; and\r\n(n) economic, indirect or consequential loss, whether or not those losses overlap (including,\r\nin any case, but not limited to loss of anticipated profits or savings), whether or not\r\nreasonably foreseeable.\r\n14.5 Subject to a Preserved Liability, we are not responsible for any Loss or other liability incurred by\r\nApplicant to the extent arising from us acting or refraining to act within our rights and powers or\r\nif any transaction or process is interrupted, fails to complete or take place due to the failure of\r\nany other person’s website, any email, broadband, telephone, messaging or other electronic\r\ncommunication service or third party act or omission.\r\n14.6 To the extent permitted by law, only if our liability to Applicant or other Entropy Token Owner is\r\nnot limited as expressly set out elsewhere in these Terms, then our aggregate liability to\r\nApplicant under these Terms is limited to the amount Applicant has paid us in the two years\r\npreceding the breach (valued as at the time of payment to us). If it is determined by a court that\r\nby law we are not permitted to disclaim or to limit our liability to Applicant or we are not\r\npermitted to limit the amount of compensation we may be liable for, or any of those limitations\r\nare unenforceable, then those limits are severed from these Terms as though they were not in it\r\nfrom the beginning of application of these Terms to our relationship with Applicant.\r\n15. Indemnities\r\n15.1 Subject to a Preserved Liability, Applicant indemnifies us against all losses, claims, damages,\r\ncosts and expenses (including all reasonable legal expenses actually incurred) or any other\r\nremedies arising directly or indirectly as a result of:\r\n(a) taxes and other government levies or charges imposed on Applicant or transactions\r\nmade for Applicant;\r\n(b) Applicant’s breach of these Terms;\r\n(c) Applicant’s breach of any law or regulation;\r\n(d) us acting in accordance with Applicant’s instructions or relying on information given by\r\nApplicant or Applicant’s behalf; and\r\n(e) claims of any kind by any third parties in relation to our obligations under these Terms,\r\nexcept to the extent the claims, damages, costs and expenses were a result of our negligence,\r\nwilful misconduct or fraud or our breach of these Terms. This provision survives termination of\r\nthese Terms, any agreement formed under it and the completion or other end of the Token\r\nSale.\r\n16. Confidentiality and privacy\r\n16.1 We will keep confidential all of Applicant’s personal information and all other of Applicant’s\r\nconfidential information so we will not disclose or use it except if one or more of the following\r\napplies:\r\n(a) as permitted by law, including when compelled by a notice or order properly issued by a\r\nregulatory authority;\r\n(b) as permitted by Applicant; and\r\n(c) in accordance with these Terms or as permitted by our privacy policy from time to time.\r\n16.2 We will make reasonable efforts to keep any such information that we have about Applicant\r\nsecure and to ensure that any of our employees or agents who have access to the information\r\nabout Applicant do not make any unauthorised use, modification, reproduction or disclosure of\r\nthat information.\r\n16.3 We will comply with our privacy policy.\r\n17. General\r\n17.1 To the extent this document conflicts with the Website or any other document, including but not\r\nlimited to other Token Sale Documents, these Terms prevail.\r\n17.2 Time is of the essence of performance of a person’s obligations under these Terms. If these\r\nTerms specify when the party must perform an obligation or the last time to preform the\r\nobligation, the party must perform it by the time specified. Each party must perform all other\r\nobligations promptly.\r\n17.3 Applicant must pay or provide to us any amount or other consideration due to us in full, without\r\ndeduction or set-off (and irrespective of any counterclaim) whatever.\r\n17.4 A person with a right arising under these Terms (including an Entropy Foundation Person other\r\nthan Entropy Foundation) may exercise the right in any way it considers appropriate (including\r\nby imposing conditions), unless these Terms expressly states otherwise. A reference in these\r\nTerms to Entropy Foundation having a right in its absolute discretion includes Entropy\r\nFoundation not being bound to make enquiries or to give reasons.\r\n17.5 A person entitled to a remedy arising under or otherwise in relation to these Terms (including an\r\nEntropy Foundation Person other than Entropy Foundation) may exercise the remedy in any\r\nway it considers appropriate.\r\n17.6 A person whose consent is required under these Terms (including an Entropy Foundation\r\nPerson other than Entropy Foundation) may refuse its consent without having to give reasons\r\nfor that or offer its consent in any way it considers appropriate (including by imposing\r\nconditions), unless these Terms expressly states otherwise.\r\n17.7 If a person with the benefit of these Terms does not exercise a right or remedy fully or at a given\r\ntime, the party may still exercise it later.\r\n17.8 A person is not liable for loss caused by the exercise or attempted exercise of, failure to\r\nexercise, or delay in exercising, a right or remedy however they arise under or in relation to\r\nthese Terms.\r\n17.9 By giving its approval or consent, a person does not make or give any warranty or\r\nrepresentation as to any circumstance relating to the subject matter of the consent or approval.\r\n17.10 The rights and remedies provided in these Terms are in addition to other rights and remedies\r\ngiven by law independently of these Terms.\r\n17.11 The indemnities and rights to be reimbursed arising under these Terms are continuing\r\nobligations, independent from the other obligations of persons arising under these Terms and\r\ncontinue after the Token Sale ends. It is not necessary for a person to incur expense or make\r\npayment before enforcing a right of indemnity or reimbursement arising under or in relation to\r\nthese Terms.\r\n17.12 All notices must be in English. Unless otherwise specified or agreed, all notices may be given\r\nby a person to the other in writing by email or by other electronic communication service\r\nacceptable to is (including through our Website).\r\n17.13 Nothing in the Token Sale or otherwise arising under the Terms may be taken as giving rise to a\r\nrelationship of employment, joint venture or partnership nor as to any agency or fiduciary\r\nrelationships.\r\n17.14 Failure or neglect by a person to enforce any of the provisions of these Terms must not be\r\nconstrued as, nor may be deemed to be, a waiver of their rights arising under these Terms nor\r\nprejudice their rights to take subsequent action.\r\n17.15 We only recognise one person as an Applicant or as an Entropy Token Owner. Any application\r\nmade in the name of two or more persons cannot be accepted.\r\n17.16 Applicant may not assign any agreement arising from the Token Sale or these Terms, because\r\nit is personal to Applicant. This clause has no effect on the nature or transferability of Entropy\r\nTokens.\r\n17.17 These Terms set out the only terms for the Token Sale. An agreement for sale of Entropy\r\nTokens may only arise under these Terms. There may not be any other agreement between\r\nApplicant and Entropy Foundation (or any other Entropy Foundation Person) in relation to your\r\nparticipation in the Token Sale and being assigned, controlling and holding Entropy Tokens.\r\n17.18 We may amend these Terms by publication of new Terms on our Website.\r\n(a) Entropy Foundation will not give any other notice of the amendments. Such amendments\r\nwill be effective immediately upon publication on the Website, whether or not you have\r\nread the amendments or are aware of them.\r\n(b) The latest version of these Terms will automatically apply to all applications which have\r\nnot been settled by creation of the Entropy Tokens for them.\r\n(c) If we determine that the amendment may adversely affect applicants for Entropy Tokens\r\nas a whole (without taking into account any particular applicant), we may in our absolute\r\ndiscretion make arrangements which we decide are reasonable for allowing applicants to\r\nwithdraw from the Token Sale.\r\n(d) We will not be liable for any Loss arising out of any amendment of the Terms or any\r\nwithdrawal by Applicant.\r\n(e) Entropy Foundation will only amend these Terms for one or more of these\r\npurposes: if it believes it is reasonable for clarifying any aspect of these\r\nTerms; to facilitate the proper conduct of the Token Sale; to manage legal or\r\ntaxation requirements (including to respond to a change in law or a policy for\r\nadministering a law); and to prevent or to minimise unlawful conduct.\r\n17.19 If any term or other provision of these Terms is held by a court to be illegal, invalid or\r\nunenforceable under the applicable law, then that term or provision is to be interpreted as being\r\nsevered from these Terms and the remaining Terms will be unaffected by that.\r\n18. Glossary\r\nIn these Terms, the following expressions have their defined meanings given below.\r\nApplicant means the person applying for Entropy Token in the Token Sale (whether or not\r\nthey are in fact the person whose identity is given for that application).\r\nAssociate has the meaning given in the Corporations Act 2001 (Commonwealth of Australia).\r\nblockchain token means a token, digicurrency, cryptocurrency or analogous blockchainbased\r\ntransferrable, smart contract based technology or software.\r\nBlockchain-token Technology means blockchain tokens, cryptocurrencies and/or\r\nblockchain-based software systems.\r\nClosing Time means the earlier of (a) the time specified on the Website (from time to time) as\r\nthe Closing Time and (b) the time when all available Entropy Token in the Token Sale are\r\nallocated or otherwise committed by all applicants.\r\nCommencement Time means the time applications in the Token Sale on the Website are first\r\npublicly accessible. This does not include pre-sales, commitments of allocations prior to\r\npublic access or prior registrations of interest.\r\nControl means, with respect to any person, the possession, directly or indirectly (including\r\nthrough any number of interposed persons), of the power to direct or cause the direction of the\r\nmanagement and policies of such person, whether through the ownership of voting securities,\r\nby contract or otherwise and Controlled has a corresponding meaning.\r\ndigicurrency means a blockchain token which is primarily used or designed for being used as\r\na means of decentralised, distributable and transferable record of value or information (by\r\nwhatever name, including general names such as cryptocurrency or propriety names).\r\nEntropy Foundation means Entropy Foundation Pty Ltd ACN 622 139 922 established under\r\nthe laws of Australia and having its registered office at Suite 1, No. 4 Belgrave Street, Manly\r\nNSW 2095 Australia.\r\nEntropy Foundation Person means Entropy Foundation, each Associate of it and any\r\nRelated Party of Entropy Foundation or of their Associates.\r\nEntropy Token has the meaning given in clause 9.1.\r\nEntropy Token Owner means the person who controls the address of the Entropy Token for\r\nthe purposes of the Blockchain-token Technology applying to Entropy Tokens, whether or not\r\nEntropy Foundation is (or later becomes) aware of the identity of that person or Entropy\r\nFoundation is (or later becomes) put on notice of any claim or other interest in ownership or\r\ncontrol of the Entropy Token.\r\nHut34 means the ecosystem described in the Whitepaper, intended to be developed by\r\nEntropy Foundation. It includes all related networks, platforms, protocols, software,\r\nintellectual property and connectivity which is developed by Entropy Foundation for any part of\r\nHut34.\r\nLoss means damages, claims, applications, loss, injuries, delays, accidents, costs, business\r\ninterruption, expenses (including, without limitation, lawyer’s or legal fees or the costs of any\r\nclaim or suit), any incidental, direct, indirect, general, special, punitive, exemplary, special or\r\nconsequential damages, any loss of goodwill, profits or revenue or any other economic loss,\r\nany loss of digicurrency or digital assets, any work stoppage, data loss, computer failure or\r\nmalfunction, or any other financial, business, personal, commercial or other loss.\r\nPreserved Liability has the meaning given in clause 14.3.\r\nRelated Party means each of:\r\n(a) directors of Entropy Foundation;\r\n(b) shareholders of Entropy Foundation;\r\n(c) directors of shareholders of Entropy Foundation.\r\nToken Disclosure Statement and TDS mean the current version of the document of that\r\nname as published on the Website from time to time.\r\nToken Sale Documents means these Terms, the current TDS and the current Whitepaper\r\nfrom time to time.\r\nToken Sale means the process contemplated in these Terms by which Applicants apply for\r\nEntropy Tokens.\r\nWebsite means the webpage at https://hut34.io/ and all of its sub-pages including the\r\ndashboard at https://hut34.io/entropySale.\r\nWhitepaper means the current HuT34 Whitepaper as published on the Website from time to\r\ntime.\r\n“we” and “our” refer to Entropy Foundation.\r\n“you” and “your” refer to the person who is identified as Applicant in using the Website for\r\nthe Token Sale, whether or not they are in fact that person.\r\n19. Interpretation\r\n19.1 Words in these Terms expressed in the singular include the plural and vice versa.\r\n19.2 A reference in these Terms to a document or agreement includes any variation or replacement\r\nof it.\r\n19.3 Headings in the Terms are for reference only and do not in any way affect the meaning of these\r\nTerms.\r\n19.4 Unless the context requires, a reference in the Terms to any legislation includes any statutory\r\nmodification or re-enactment of, or legislative provision substituted for, and any subordinate\r\nlegislation issued under that legislation or legislative provision.\r\n19.5 A provision of these Terms must not be interpreted against our interests merely because these\r\nare standard terms provided by us.\r\n*/\r\n\r\n// Contract configuration\r\ncontract TokenConfig {\r\n    string public constant symbol = \"AUDAXDOC\";\r\n    string public constant name = \"Audax Legal Document Token\";\r\n    uint8 public constant decimals = 0;\r\n    uint256 _totalSupply = 42000;\r\n}\r\n\r\n// ERC Token Standard #20 Interface\r\n// https://github.com/ethereum/EIPs/issues/20\r\ncontract ERC20Interface {\r\n    // Get the total token supply\r\n    function totalSupply() constant returns (uint256 totalSupply);\r\n\r\n    // Get the account balance of another account with address _owner\r\n    function balanceOf(address _owner) constant returns (uint256 balance);\r\n\r\n    // Send _value amount of tokens to address _to\r\n    function transfer(address _to, uint256 _value) returns (bool success);\r\n\r\n    // Send _value amount of tokens from address _from to address _to\r\n    function transferFrom(address _from, address _to, uint256 _value) returns (bool success);\r\n\r\n    // Allow _spender to withdraw from your account, multiple times, up to the _value amount.\r\n    // If this function is called again it overwrites the current allowance with _value.\r\n    // this function is required for some DEX functionality\r\n    function approve(address _spender, uint256 _value) returns (bool success);\r\n\r\n    // Returns the amount which _spender is still allowed to withdraw from _owner\r\n    function allowance(address _owner, address _spender) constant returns (uint256 remaining);\r\n\r\n    // Triggered when tokens are transferred.\r\n    event Transfer(address indexed _from, address indexed _to, uint256 _value);\r\n\r\n    // Triggered whenever approve(address _spender, uint256 _value) is called.\r\n    event Approval(address indexed _owner, address indexed _spender, uint256 _value);\r\n}\r\n\r\ncontract AudaxDocToken is ERC20Interface, TokenConfig {\r\n    // Owner of this contract\r\n    address public owner;\r\n\r\n    // Balances for each account\r\n    mapping(address => uint256) balances;\r\n\r\n    // Owner of account approves the transfer of an amount to another account\r\n    mapping(address => mapping (address => uint256)) allowed;\r\n\r\n    // Functions with this modifier can only be executed by the owner\r\n    modifier onlyOwner() {\r\n        if (msg.sender != owner) {\r\n            revert();\r\n        }\r\n        _;\r\n    }\r\n\r\n    // Constructor\r\n    function AudaxDocToken() {\r\n        owner = 0xf484aE9Fb7289d196b6C9596D2639E5B535adE8e;\r\n        balances[owner] = _totalSupply;\r\n    }\r\n\r\n    function totalSupply() constant returns (uint256 totalSupply) {\r\n        totalSupply = _totalSupply;\r\n    }\r\n\r\n    // What is the balance of a particular account?\r\n    function balanceOf(address _owner) constant returns (uint256 balance) {\r\n        return balances[_owner];\r\n    }\r\n\r\n    // Transfer the balance from owner's account to another account\r\n    function transfer(address _to, uint256 _amount) returns (bool success) {\r\n        if (balances[msg.sender] >= _amount\r\n            && _amount > 0\r\n            && balances[_to] + _amount > balances[_to]) {\r\n            balances[msg.sender] -= _amount;\r\n            balances[_to] += _amount;\r\n            Transfer(msg.sender, _to, _amount);\r\n            return true;\r\n        } else {\r\n            return false;\r\n        }\r\n    }\r\n\r\n    // Send _value amount of tokens from address _from to address _to\r\n    // The transferFrom method is used for a withdraw workflow, allowing contracts to send\r\n    // tokens on your behalf, for example to \"deposit\" to a contract address and/or to charge\r\n    // fees in sub-currencies; the command should fail unless the _from account has\r\n    // deliberately authorized the sender of the message via some mechanism; we propose\r\n    // these standardized APIs for approval:\r\n    function transferFrom(\r\n        address _from,\r\n        address _to,\r\n        uint256 _amount\r\n) returns (bool success) {\r\n        if (balances[_from] >= _amount\r\n            && allowed[_from][msg.sender] >= _amount\r\n            && _amount > 0\r\n            && balances[_to] + _amount > balances[_to]) {\r\n            balances[_from] -= _amount;\r\n            allowed[_from][msg.sender] -= _amount;\r\n            balances[_to] += _amount;\r\n            Transfer(_from, _to, _amount);\r\n            return true;\r\n        } else {\r\n            return false;\r\n        }\r\n    }\r\n\r\n    // Allow _spender to withdraw from your account, multiple times, up to the _value amount.\r\n    // If this function is called again it overwrites the current allowance with _value.\r\n    function approve(address _spender, uint256 _amount) returns (bool success) {\r\n        allowed[msg.sender][_spender] = _amount;\r\n        Approval(msg.sender, _spender, _amount);\r\n        return true;\r\n    }\r\n\r\n    function allowance(address _owner, address _spender) constant returns (uint256 remaining) {\r\n        return allowed[_owner][_spender];\r\n    }\r\n}\r\n\r\ncontract AudaxDocWithMeta is AudaxDocToken {\r\n    event AudaxDocTxDetails(address indexed _from, string audaxTxDetail, uint256 amount);\r\n\r\n    function logAudaxTxDetails(string audaxTxDetail, uint256 amount) {\r\n        if (!transfer(owner, amount)) revert();\r\n        AudaxDocTxDetails(msg.sender, audaxTxDetail, amount);\r\n    }\r\n}","ABI":"[{\"constant\":true,\"inputs\":[],\"name\":\"name\",\"outputs\":[{\"name\":\"\",\"type\":\"string\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"_spender\",\"type\":\"address\"},{\"name\":\"_amount\",\"type\":\"uint256\"}],\"name\":\"approve\",\"outputs\":[{\"name\":\"success\",\"type\":\"bool\"}],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"totalSupply\",\"outputs\":[{\"name\":\"totalSupply\",\"type\":\"uint256\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"_from\",\"type\":\"address\"},{\"name\":\"_to\",\"type\":\"address\"},{\"name\":\"_amount\",\"type\":\"uint256\"}],\"name\":\"transferFrom\",\"outputs\":[{\"name\":\"success\",\"type\":\"bool\"}],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"audaxTxDetail\",\"type\":\"string\"},{\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"logAudaxTxDetails\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"decimals\",\"outputs\":[{\"name\":\"\",\"type\":\"uint8\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[{\"name\":\"_owner\",\"type\":\"address\"}],\"name\":\"balanceOf\",\"outputs\":[{\"name\":\"balance\",\"type\":\"uint256\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"owner\",\"outputs\":[{\"name\":\"\",\"type\":\"address\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"symbol\",\"outputs\":[{\"name\":\"\",\"type\":\"string\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"_to\",\"type\":\"address\"},{\"name\":\"_amount\",\"type\":\"uint256\"}],\"name\":\"transfer\",\"outputs\":[{\"name\":\"success\",\"type\":\"bool\"}],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[{\"name\":\"_owner\",\"type\":\"address\"},{\"name\":\"_spender\",\"type\":\"address\"}],\"name\":\"allowance\",\"outputs\":[{\"name\":\"remaining\",\"type\":\"uint256\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"name\":\"_from\",\"type\":\"address\"},{\"indexed\":false,\"name\":\"audaxTxDetail\",\"type\":\"string\"},{\"indexed\":false,\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"AudaxDocTxDetails\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"name\":\"_from\",\"type\":\"address\"},{\"indexed\":true,\"name\":\"_to\",\"type\":\"address\"},{\"indexed\":false,\"name\":\"_value\",\"type\":\"uint256\"}],\"name\":\"Transfer\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"name\":\"_owner\",\"type\":\"address\"},{\"indexed\":true,\"name\":\"_spender\",\"type\":\"address\"},{\"indexed\":false,\"name\":\"_value\",\"type\":\"uint256\"}],\"name\":\"Approval\",\"type\":\"event\"}]","ContractName":"AudaxDocWithMeta","CompilerVersion":"v0.4.18+commit.9cf6e910","OptimizationUsed":"0","Runs":"200","ConstructorArguments":"","Library":"","SwarmSource":"bzzr://cc7102a8dbcad42c34359db16248d81630848b40d0e1e53c8db516f9d32a9a69"}]}