{"status":"1","message":"OK","result":[{"SourceCode":"pragma solidity ^0.4.13;\r\n\r\nlibrary SafeMath {\r\n\r\n  /**\r\n  * @dev Multiplies two numbers, throws on overflow.\r\n  */\r\n  function mul(uint256 a, uint256 b) internal pure returns (uint256 c) {\r\n    if (a == 0) {\r\n      return 0;\r\n    }\r\n    c = a * b;\r\n    assert(c / a == b);\r\n    return c;\r\n  }\r\n\r\n  /**\r\n  * @dev Integer division of two numbers, truncating the quotient.\r\n  */\r\n  function div(uint256 a, uint256 b) internal pure returns (uint256) {\r\n    // assert(b > 0); // Solidity automatically throws when dividing by 0\r\n    // uint256 c = a / b;\r\n    // assert(a == b * c + a % b); // There is no case in which this doesn't hold\r\n    return a / b;\r\n  }\r\n\r\n  /**\r\n  * @dev Subtracts two numbers, throws on overflow (i.e. if subtrahend is greater than minuend).\r\n  */\r\n  function sub(uint256 a, uint256 b) internal pure returns (uint256) {\r\n    assert(b <= a);\r\n    return a - b;\r\n  }\r\n\r\n  /**\r\n  * @dev Adds two numbers, throws on overflow.\r\n  */\r\n  function add(uint256 a, uint256 b) internal pure returns (uint256 c) {\r\n    c = a + b;\r\n    assert(c >= a);\r\n    return c;\r\n  }\r\n}\r\n\r\ncontract Ownable {\r\n  address public owner;\r\n\r\n\r\n  event OwnershipTransferred(address indexed previousOwner, address indexed newOwner);\r\n\r\n\r\n  /**\r\n   * @dev The Ownable constructor sets the original `owner` of the contract to the sender\r\n   * account.\r\n   */\r\n  function Ownable() public {\r\n    owner = msg.sender;\r\n  }\r\n\r\n  /**\r\n   * @dev Throws if called by any account other than the owner.\r\n   */\r\n  modifier onlyOwner() {\r\n    require(msg.sender == owner);\r\n    _;\r\n  }\r\n\r\n  /**\r\n   * @dev Allows the current owner to transfer control of the contract to a newOwner.\r\n   * @param newOwner The address to transfer ownership to.\r\n   */\r\n  function transferOwnership(address newOwner) public onlyOwner {\r\n    require(newOwner != address(0));\r\n    emit OwnershipTransferred(owner, newOwner);\r\n    owner = newOwner;\r\n  }\r\n\r\n}\r\n\r\ncontract EthPlot is Ownable {\r\n\r\n    /// @dev Represents a single plot (rectangle) which is owned by someone. Additionally, it contains an array\r\n    /// of holes which point to other PlotOwnership structs which overlap this one (and purchased a chunk of this one)\r\n    /// 4 24 bit numbers for + 1 address = 256 bits for storage efficiency\r\n    struct PlotOwnership {\r\n\r\n        // Coordinates of the plot rectangle\r\n        uint24 x;\r\n        uint24 y;\r\n        uint24 w;\r\n        uint24 h;\r\n\r\n        // The owner of the plot\r\n        address owner;\r\n    }\r\n\r\n    /// @dev Represents the data which a specific plot ownership has\r\n    struct PlotData {\r\n        string ipfsHash;\r\n        string url;\r\n    }\r\n\r\n    //----------------------State---------------------//\r\n\r\n    // The actual coordinates and owners of plots. This array will contain all of the owned plots, with the more recent (and valid)\r\n    // ownership plots at the top. The other state variables point to indexes in this array\r\n    PlotOwnership[] private ownership;\r\n\r\n    // Maps from the index in the ownership array to the data for this particular plot (its image and website)\r\n    mapping(uint256 => PlotData) private data;\r\n\r\n    // Maps plot ID to a boolean that represents whether or not\r\n    // the image of the plot might be illegal and need to be blocked\r\n    // in the UI of Eth Plot. Defaults to false.\r\n    mapping (uint256 => bool) private plotBlockedTags;\r\n\r\n    // Maps plot ID to the plot's current price price. If price is 0, the plot is not for sale. Price is Wei per pixel.\r\n    mapping(uint256 => uint256) private plotIdToPrice;\r\n\r\n    // Maps plot ID to other plots IDs which which have purchased sections of this plot (a hole).\r\n    // Once a plot has been completely re-purchased, these holes will completely tile over the plot.\r\n    mapping(uint256 => uint256[]) private holes;\r\n    \r\n    //----------------------Constants---------------------//\r\n    uint24 constant private GRID_WIDTH = 250;\r\n    uint24 constant private GRID_HEIGHT = 250;\r\n    uint256 constant private INITIAL_PLOT_PRICE = 20000 * 1000000000; // 20000 gwei (approx. $0.01)\r\n\r\n    // This is the maximum area of a single purchase block. This needs to be limited for the\r\n    // algorithm which figures out payment to function\r\n    uint256 constant private MAXIMUM_PURCHASE_AREA = 1000;\r\n      \r\n    //----------------------Events---------------------//\r\n\r\n    /// @notice Inicates that a user has updated the price of their plot\r\n    /// @param plotId The index in the ownership array which was updated\r\n    /// @param newPriceInWeiPerPixel The new price of the plotId\r\n    /// @param owner The current owner of the plot\r\n    event PlotPriceUpdated(uint256 plotId, uint256 newPriceInWeiPerPixel, address indexed owner);\r\n\r\n    /// @notice Indicates that a new plot has been purchased and added to the ownership array\r\n    /// @param newPlotId The id (index in the ownership array) of the new plot\r\n    /// @param totalPrice The total price paid in wei to all the plots which used to own this area\r\n    /// @param buyer The account which made the purchase \r\n    event PlotPurchased(uint256 newPlotId, uint256 totalPrice, address indexed buyer);\r\n\r\n    /// @notice Indicates that a section of a plot was purchased. Multiple PlotSectionSold events could be emitted from\r\n    /// a single purchase transaction\r\n    /// @param plotId The id (index in the ownership array) of the plot which had a section of it purchased\r\n    /// @param totalPrice The total price which was paid for this section\r\n    /// @param buyer The buyer of the section of the plot\r\n    /// @param seller The owner of the plot which was purchased. This is who will receive totalPrice in their account\r\n    event PlotSectionSold(uint256 plotId, uint256 totalPrice, address indexed buyer, address indexed seller);\r\n\r\n    /// @notice Creates a new instance of the EthPlot contract. It assigns an initial ownership plot consisting of the entire grid\r\n    /// to the creator of the contract who will also receive any transaction fees.\r\n    constructor() public payable {\r\n        // Initialize the contract with a single block which the admin owns\r\n        ownership.push(PlotOwnership(0, 0, GRID_WIDTH, GRID_HEIGHT, owner));\r\n        data[0] = PlotData(\"Qmb51AikiN8p6JsEcCZgrV4d7C6d6uZnCmfmaT15VooUyv/img.svg\", \"https://www.ethplot.com/\");\r\n        plotIdToPrice[0] = INITIAL_PLOT_PRICE;\r\n    }\r\n\r\n    //---------------------- External  and Public Functions ---------------------//\r\n\r\n    /// @notice Purchases a new plot with at the location (`purchase[0]`,`purchase[1]`) and dimensions `purchase[2]`x`purchase[2]`.\r\n    /// The new plot will have the data stored at ipfs hash `ipfsHash` and a website of `url`\r\n    /// @dev This function is the way you purchase new plots from the chain. The data is specified in a somewhat unique format to\r\n    /// make the execution of the contract as efficient as possible. Essentially, the caller needs to send in an array of sub-plots which\r\n    /// form a complete tiling of the purchased area. These sub-plots represent sections of the already existing plots this purchase is\r\n    /// happening on top of. The contract will validate all of this data before allowing the purchase to proceed.\r\n    /// @param purchase An array of exactly 4 values which represent the [x,y,width,height] of the plot to purchase\r\n    /// @param purchasedAreas An array of at least 4 values. Each set of 4 values represents a sub-plot which must be purchased for this\r\n    /// plot to be created. If the new plot to purchase overlaps in a non-rectangle pattern, multiple rectangular sub-plots from that\r\n    /// plot can be specified. The sub-plots must be from existing plots in descending order of that plot's index\r\n    /// @param areaIndices An area of indices into the ownership array which represent which plot the rectangles in purchasedAreas are\r\n    /// coming from. Must be equal to 1/4 the length of purchasedAreas\r\n    /// @param ipfsHash The hash of the image data for this plot stored in ipfs\r\n    /// @param url The website / url which should be associated with this plot\r\n    /// @param initialBuyoutPriceInWeiPerPixel The price per pixel a future buyer would have to pay to purchase an area of this plot.\r\n    /// Set a price of 0 to mark that this plot is not for sale\r\n    function purchaseAreaWithData(\r\n        uint24[] purchase,\r\n        uint24[] purchasedAreas,\r\n        uint256[] areaIndices,\r\n        string ipfsHash,\r\n        string url,\r\n        uint256 initialBuyoutPriceInWeiPerPixel) external payable {\r\n        \r\n        // Validate that all of the data makes sense and is valid, then payout the plot sellers\r\n        uint256 initialPurchasePrice = validatePurchaseAndDistributeFunds(purchase, purchasedAreas, areaIndices);\r\n\r\n        // After we've validated that this purchase is valid, actually put the new plot and info in storage locations\r\n        uint256 newPlotIndex = addPlotAndData(purchase, ipfsHash, url, initialBuyoutPriceInWeiPerPixel);\r\n\r\n        // Now that purchase is completed, update plots that have new holes due to this purchase\r\n        for (uint256 i = 0; i < areaIndices.length; i++) {\r\n            holes[areaIndices[i]].push(newPlotIndex);\r\n        }\r\n\r\n        // Finally, emit an event to indicate that this purchase happened\r\n        emit PlotPurchased(newPlotIndex, initialPurchasePrice, msg.sender);\r\n    }\r\n\r\n    /// @notice Updates the price per pixel of a plot which the message sender owns. A price of 0 means the plot is not for sale\r\n    /// @param plotIndex The index in the ownership array which we are updating. msg.sender must be the owner of this plot\r\n    /// @param newPriceInWeiPerPixel The new price of the plot\r\n    function updatePlotPrice(uint256 plotIndex, uint256 newPriceInWeiPerPixel) external {\r\n        require(plotIndex >= 0);\r\n        require(plotIndex < ownership.length);\r\n        require(msg.sender == ownership[plotIndex].owner);\r\n\r\n        plotIdToPrice[plotIndex] = newPriceInWeiPerPixel;\r\n        emit PlotPriceUpdated(plotIndex, newPriceInWeiPerPixel, msg.sender);\r\n    }\r\n\r\n    /// @notice Updates the data for a specific plot. This is only allowed by the plot's owner\r\n    /// @param plotIndex The index in the ownership array which we are updating. msg.sender must be the owner of this plot\r\n    /// @param ipfsHash The hash of the image data for this plot stored in ipfs\r\n    /// @param url The website / url which should be associated with this plot\r\n    function updatePlotData(uint256 plotIndex, string ipfsHash, string url) external {\r\n        require(plotIndex >= 0);\r\n        require(plotIndex < ownership.length);\r\n        require(msg.sender == ownership[plotIndex].owner);\r\n\r\n        data[plotIndex] = PlotData(ipfsHash, url);\r\n    }\r\n\r\n    // ---------------------- Public Admin Functions ---------------------//\r\n    \r\n    /// @notice Withdraws the fees which have been collected back to the contract owner, who is the only person that can call this\r\n    /// @param transferTo Who the transfer should go to. This must be the admin, but we pass it as a parameter to prevent a frontrunning\r\n    /// issue if we change ownership of the contract.\r\n    function withdraw(address transferTo) onlyOwner external {\r\n        // Prevent https://consensys.github.io/smart-contract-best-practices/known_attacks/#transaction-ordering-dependence-tod-front-running\r\n        require(transferTo == owner);\r\n\r\n        uint256 currentBalance = address(this).balance;\r\n        owner.transfer(currentBalance);\r\n    }\r\n\r\n    /// @notice Sets whether or not the image data in a plot should be blocked from the EthPlot UI. This is used to take down\r\n    /// illegal content if needed. The image data is not actually deleted, just no longer visible in the UI\r\n    /// @param plotIndex The index in the ownership array where the illegal data is located\r\n    /// @param plotBlocked Whether or not this data should be blocked\r\n    function togglePlotBlockedTag(uint256 plotIndex, bool plotBlocked) onlyOwner external {\r\n        require(plotIndex >= 0);\r\n        require(plotIndex < ownership.length);\r\n        plotBlockedTags[plotIndex] = plotBlocked;\r\n    }\r\n\r\n    // ---------------------- Public View Functions ---------------------//\r\n\r\n    /// @notice Gets the information for a specific plot based on its index.\r\n    /// @dev Due to stack too deep issues, to get all the info about a plot, you must also call getPlotData in conjunction with this\r\n    /// @param plotIndex The index in the ownership array to get the plot info for\r\n    /// @return The coordinates of this plot, the owner address, and the current buyout price of it (0 if not for sale)\r\n    function getPlotInfo(uint256 plotIndex) public view returns (uint24 x, uint24 y, uint24 w , uint24 h, address owner, uint256 price) {\r\n        require(plotIndex < ownership.length);\r\n        return (\r\n            ownership[plotIndex].x,\r\n            ownership[plotIndex].y,\r\n            ownership[plotIndex].w,\r\n            ownership[plotIndex].h,\r\n            ownership[plotIndex].owner,\r\n            plotIdToPrice[plotIndex]);\r\n    }\r\n\r\n    /// @notice Gets the data stored with a specific plot. This includes the website, ipfs hash, and the blocked status of the image\r\n    /// @dev Due to stack too deep issues, to get all the info about a plot, you must also call getPlotInfo in conjunction with this\r\n    /// @param plotIndex The index in the ownership array to get the plot data for\r\n    /// @return The ipfsHash of the plot's image, the website associated with the plot, and whether or not its image is blocked\r\n    function getPlotData(uint256 plotIndex) public view returns (string ipfsHash, string url, bool plotBlocked) {\r\n        require(plotIndex < ownership.length);\r\n        return (data[plotIndex].url, data[plotIndex].ipfsHash, plotBlockedTags[plotIndex]);\r\n    }\r\n    \r\n    /// @notice Gets the length of the ownership array which represents the number of owned plots which exist\r\n    /// @return The number of plots which are owned on the grid\r\n    function ownershipLength() public view returns (uint256) {\r\n        return ownership.length;\r\n    }\r\n    \r\n    //---------------------- Private Functions ---------------------//\r\n\r\n    /// @notice This function does a lot of the heavy lifting for validating that all of the data passed in to the purchase function is ok.\r\n    /// @dev It works by first validating all of the inputs and converting purchase and purchasedAreas into rectangles for easier manipulation.\r\n    /// Next, it validates that all of the rectangles in purchasedArea are within the area to purchase, and that they form a complete tiling of\r\n    /// the purchase we are making with zero overlap. Next, to prevent stack too deep errors, it delegates the work of validating that these sub-plots\r\n    /// are actually for sale, are valid, and pays out the previous owners of the area.\r\n    /// @param purchase An array of exactly 4 values which represent the [x,y,width,height] of the plot to purchase\r\n    /// @param purchasedAreas An array of at least 4 values. Each set of 4 values represents a sub-plot which must be purchased for this\r\n    /// plot to be created.\r\n    /// @param areaIndices An area of indices into the ownership array which represent which plot the rectangles in purchasedAreas are from\r\n    /// @return The amount spent to purchase all of the subplots specified in purchasedAreas\r\n    function validatePurchaseAndDistributeFunds(uint24[] purchase, uint24[] purchasedAreas, uint256[] areaIndices) private returns (uint256) {\r\n        // Validate that we were given a valid area to purchase\r\n        require(purchase.length == 4);\r\n        Geometry.Rect memory plotToPurchase = Geometry.Rect(purchase[0], purchase[1], purchase[2], purchase[3]);\r\n        \r\n        require(plotToPurchase.x < GRID_WIDTH && plotToPurchase.x >= 0);\r\n        require(plotToPurchase.y < GRID_HEIGHT && plotToPurchase.y >= 0);\r\n\r\n        // No need for SafeMath here because we know plotToPurchase.x & plotToPurchase.y are less than 250 (~2^8)\r\n        require(plotToPurchase.w > 0 && plotToPurchase.w + plotToPurchase.x <= GRID_WIDTH);\r\n        require(plotToPurchase.h > 0 && plotToPurchase.h + plotToPurchase.y <= GRID_HEIGHT);\r\n        require(plotToPurchase.w * plotToPurchase.h < MAXIMUM_PURCHASE_AREA);\r\n\r\n        // Validate the purchasedAreas and the purchasedArea's indices\r\n        require(purchasedAreas.length >= 4);\r\n        require(areaIndices.length > 0);\r\n        require(purchasedAreas.length % 4 == 0);\r\n        require(purchasedAreas.length / 4 == areaIndices.length);\r\n\r\n        // Build up an array of subPlots which represent all of the sub-plots we are purchasing\r\n        Geometry.Rect[] memory subPlots = new Geometry.Rect[](areaIndices.length);\r\n\r\n        uint256 totalArea = 0;\r\n        uint256 i = 0;\r\n        uint256 j = 0;\r\n        for (i = 0; i < areaIndices.length; i++) {\r\n            // Define the rectangle and add it to our collection of them\r\n            Geometry.Rect memory rect = Geometry.Rect(\r\n                purchasedAreas[(i * 4)], purchasedAreas[(i * 4) + 1], purchasedAreas[(i * 4) + 2], purchasedAreas[(i * 4) + 3]);\r\n            subPlots[i] = rect;\r\n\r\n            require(rect.w > 0);\r\n            require(rect.h > 0);\r\n\r\n            // Compute the area of this rect and add it to the total area\r\n            totalArea = SafeMath.add(totalArea, SafeMath.mul(rect.w,rect.h));\r\n\r\n            // Verify that this rectangle is within the bounds of the area we are trying to purchase\r\n            require(Geometry.rectContainedInside(rect, plotToPurchase));\r\n        }\r\n\r\n        require(totalArea == plotToPurchase.w * plotToPurchase.h);\r\n\r\n        // Next, make sure all of these do not overlap\r\n        for (i = 0; i < subPlots.length; i++) {\r\n            for (j = i + 1; j < subPlots.length; j++) {\r\n                require(!Geometry.doRectanglesOverlap(subPlots[i], subPlots[j]));\r\n            }\r\n        }\r\n\r\n        // If we have a matching area, the subPlots are all contained within what we're purchasing, and none of them overlap,\r\n        // we know we have a complete tiling of the plotToPurchase. Next, validate we can purchase all of these and distribute funds\r\n        uint256 remainingBalance = checkHolesAndDistributePurchaseFunds(subPlots, areaIndices);\r\n        uint256 purchasePrice = SafeMath.sub(msg.value, remainingBalance);\r\n        return purchasePrice;\r\n    }\r\n\r\n    /// @notice Checks that the sub-plots which we are purchasing are all valid and then distributes funds to the owners of those sub-plots\r\n    /// @dev Since we know that the subPlots are contained within plotToPurchase, and that they don't overlap, we just need go through each one\r\n    /// and make sure that it is for sale and owned by the appropriate person as specified in areaIndices. We then can calculate how much to\r\n    /// pay out for the sub-plot as well.\r\n    /// @param subPlots Array of sub-plots which tiles the plotToPurchase completely\r\n    /// @param areaIndices Array of indices into the ownership array which correspond to who owns the subPlot at the same index of subPlots.\r\n    /// The array must be the same length as subPlots and go in descending order\r\n    /// @return The balance still remaining from the original msg.value after paying out all of the owners of the subPlots\r\n    function checkHolesAndDistributePurchaseFunds(Geometry.Rect[] memory subPlots, uint256[] memory areaIndices) private returns (uint256) {\r\n\r\n        // Initialize the remaining balance to the value which was passed in here\r\n        uint256 remainingBalance = msg.value;\r\n\r\n        // In order to minimize calls to transfer(), aggregate how much is owed to a single plot owner for all of their subPlots (this is \r\n        // useful in the case that the buyer is overlaping with a single plot in a non-rectangular manner)\r\n        uint256 owedToSeller = 0;\r\n\r\n        for (uint256 areaIndicesIndex = 0; areaIndicesIndex < areaIndices.length; areaIndicesIndex++) {\r\n\r\n            // Get information about the plot at this index\r\n            uint256 ownershipIndex = areaIndices[areaIndicesIndex];\r\n            Geometry.Rect memory currentOwnershipRect = Geometry.Rect(\r\n                ownership[ownershipIndex].x, ownership[ownershipIndex].y, ownership[ownershipIndex].w, ownership[ownershipIndex].h);\r\n\r\n            // This is a plot the caller has declared they were going to buy. We need to verify that the subPlot is fully contained inside \r\n            // the current ownership plot we are dealing with (we already know the subPlot is inside the plot to purchase)\r\n            require(Geometry.rectContainedInside(subPlots[areaIndicesIndex], currentOwnershipRect));\r\n\r\n            // Next, verify that none of the holes of this plot ownership overlap with what we are trying to purchase\r\n            for (uint256 holeIndex = 0; holeIndex < holes[ownershipIndex].length; holeIndex++) {\r\n                PlotOwnership memory holePlot = ownership[holes[ownershipIndex][holeIndex]];\r\n                Geometry.Rect memory holeRect = Geometry.Rect(holePlot.x, holePlot.y, holePlot.w, holePlot.h);\r\n\r\n                require(!Geometry.doRectanglesOverlap(subPlots[areaIndicesIndex], holeRect));\r\n            }\r\n\r\n            // Finally, add the price of this rect to the totalPrice computation\r\n            uint256 sectionPrice = getPriceOfPlot(subPlots[areaIndicesIndex], ownershipIndex);\r\n            remainingBalance = SafeMath.sub(remainingBalance, sectionPrice);\r\n            owedToSeller = SafeMath.add(owedToSeller, sectionPrice);\r\n\r\n            // If this is the last one to look at, or if the next ownership index is different, payout this owner\r\n            if (areaIndicesIndex == areaIndices.length - 1 || ownershipIndex != areaIndices[areaIndicesIndex + 1]) {\r\n\r\n                // Update the balances and emit an event to indicate the chunks of this plot which were sold\r\n                address(ownership[ownershipIndex].owner).transfer(owedToSeller);\r\n                emit PlotSectionSold(ownershipIndex, owedToSeller, msg.sender, ownership[ownershipIndex].owner);\r\n                owedToSeller = 0;\r\n            }\r\n        }\r\n        \r\n        return remainingBalance;\r\n    }\r\n\r\n    /// @notice Given a rect to purchase and the plot index, return the total price to be paid. Requires that the plot is for sale\r\n    /// @param subPlotToPurchase The subplot of plotIndex which we want to compute the price of\r\n    /// @param plotIndex The index in the ownership array for this plot\r\n    /// @return The price that must be paid for this subPlot\r\n    function getPriceOfPlot(Geometry.Rect memory subPlotToPurchase, uint256 plotIndex) private view returns (uint256) {\r\n\r\n        // Verify that this plot exists in the plot price mapping with a price.\r\n        uint256 plotPricePerPixel = plotIdToPrice[plotIndex];\r\n        require(plotPricePerPixel > 0);\r\n\r\n        return SafeMath.mul(SafeMath.mul(subPlotToPurchase.w, subPlotToPurchase.h), plotPricePerPixel);\r\n    }\r\n\r\n    /// @notice Stores the plot information and data for a newly purchased plot.\r\n    /// @dev All parameters are assumed to be validated before calling\r\n    /// @param purchase The coordinates of the plot to purchase\r\n    /// @param ipfsHash The hash of the image data for this plot stored in ipfs\r\n    /// @param url The website / url which should be associated with this plot\r\n    /// @param initialBuyoutPriceInWeiPerPixel The price per pixel a future buyer would have to pay to purchase an area of this plot.\r\n    /// @return The index in the plotOwnership array where this plot was placed\r\n    function addPlotAndData(uint24[] purchase, string ipfsHash, string url, uint256 initialBuyoutPriceInWeiPerPixel) private returns (uint256) {\r\n        uint256 newPlotIndex = ownership.length;\r\n\r\n        // Add the new ownership to the array\r\n        ownership.push(PlotOwnership(purchase[0], purchase[1], purchase[2], purchase[3], msg.sender));\r\n\r\n        // Take in the input data for the actual grid!\r\n        data[newPlotIndex] = PlotData(ipfsHash, url);\r\n\r\n        // Set an initial purchase price for the new plot if it's greater than 0\r\n        if (initialBuyoutPriceInWeiPerPixel > 0) {\r\n            plotIdToPrice[newPlotIndex] = initialBuyoutPriceInWeiPerPixel;\r\n        }\r\n\r\n        return newPlotIndex;\r\n    }\r\n}\r\n\r\nlibrary Geometry {\r\n    struct Rect {\r\n        uint24 x;\r\n        uint24 y;\r\n        uint24 w;\r\n        uint24 h;\r\n    }\r\n\r\n    function doRectanglesOverlap(Rect memory a, Rect memory b) internal pure returns (bool) {\r\n        return a.x < b.x + b.w && a.x + a.w > b.x && a.y < b.y + b.h && a.y + a.h > b.y;\r\n    }\r\n\r\n    // It is assumed that we will have called doRectanglesOverlap before calling this method and we will know they overlap\r\n    function computeRectOverlap(Rect memory a, Rect memory b) internal pure returns (Rect memory) {\r\n        Rect memory result = Rect(0, 0, 0, 0);\r\n\r\n        // Take the greater of the x and y values;\r\n        result.x = a.x > b.x ? a.x : b.x;\r\n        result.y = a.y > b.y ? a.y : b.y;\r\n\r\n        // Take the lesser of the x2 and y2 values\r\n        uint24 resultX2 = a.x + a.w < b.x + b.w ? a.x + a.w : b.x + b.w;\r\n        uint24 resultY2 = a.y + a.h < b.y + b.h ? a.y + a.h : b.y + b.h;\r\n\r\n        // Set our width and height here\r\n        result.w = resultX2 - result.x;\r\n        result.h = resultY2 - result.y;\r\n\r\n        return result;\r\n    }\r\n\r\n    function rectContainedInside(Rect memory inner, Rect memory outer) internal pure returns (bool) {\r\n        return inner.x >= outer.x && inner.y >= outer.y && inner.x + inner.w <= outer.x + outer.w && inner.y + inner.h <= outer.y + outer.h;\r\n    }\r\n}","ABI":"[{\"constant\":true,\"inputs\":[{\"name\":\"plotIndex\",\"type\":\"uint256\"}],\"name\":\"getPlotInfo\",\"outputs\":[{\"name\":\"x\",\"type\":\"uint24\"},{\"name\":\"y\",\"type\":\"uint24\"},{\"name\":\"w\",\"type\":\"uint24\"},{\"name\":\"h\",\"type\":\"uint24\"},{\"name\":\"owner\",\"type\":\"address\"},{\"name\":\"price\",\"type\":\"uint256\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"ownershipLength\",\"outputs\":[{\"name\":\"\",\"type\":\"uint256\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"plotIndex\",\"type\":\"uint256\"},{\"name\":\"newPriceInWeiPerPixel\",\"type\":\"uint256\"}],\"name\":\"updatePlotPrice\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"plotIndex\",\"type\":\"uint256\"},{\"name\":\"ipfsHash\",\"type\":\"string\"},{\"name\":\"url\",\"type\":\"string\"}],\"name\":\"updatePlotData\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"transferTo\",\"type\":\"address\"}],\"name\":\"withdraw\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"plotIndex\",\"type\":\"uint256\"},{\"name\":\"plotBlocked\",\"type\":\"bool\"}],\"name\":\"togglePlotBlockedTag\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[],\"name\":\"owner\",\"outputs\":[{\"name\":\"\",\"type\":\"address\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"purchase\",\"type\":\"uint24[]\"},{\"name\":\"purchasedAreas\",\"type\":\"uint24[]\"},{\"name\":\"areaIndices\",\"type\":\"uint256[]\"},{\"name\":\"ipfsHash\",\"type\":\"string\"},{\"name\":\"url\",\"type\":\"string\"},{\"name\":\"initialBuyoutPriceInWeiPerPixel\",\"type\":\"uint256\"}],\"name\":\"purchaseAreaWithData\",\"outputs\":[],\"payable\":true,\"stateMutability\":\"payable\",\"type\":\"function\"},{\"constant\":true,\"inputs\":[{\"name\":\"plotIndex\",\"type\":\"uint256\"}],\"name\":\"getPlotData\",\"outputs\":[{\"name\":\"ipfsHash\",\"type\":\"string\"},{\"name\":\"url\",\"type\":\"string\"},{\"name\":\"plotBlocked\",\"type\":\"bool\"}],\"payable\":false,\"stateMutability\":\"view\",\"type\":\"function\"},{\"constant\":false,\"inputs\":[{\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"transferOwnership\",\"outputs\":[],\"payable\":false,\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"payable\":true,\"stateMutability\":\"payable\",\"type\":\"constructor\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"name\":\"plotId\",\"type\":\"uint256\"},{\"indexed\":false,\"name\":\"newPriceInWeiPerPixel\",\"type\":\"uint256\"},{\"indexed\":true,\"name\":\"owner\",\"type\":\"address\"}],\"name\":\"PlotPriceUpdated\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"name\":\"newPlotId\",\"type\":\"uint256\"},{\"indexed\":false,\"name\":\"totalPrice\",\"type\":\"uint256\"},{\"indexed\":true,\"name\":\"buyer\",\"type\":\"address\"}],\"name\":\"PlotPurchased\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"name\":\"plotId\",\"type\":\"uint256\"},{\"indexed\":false,\"name\":\"totalPrice\",\"type\":\"uint256\"},{\"indexed\":true,\"name\":\"buyer\",\"type\":\"address\"},{\"indexed\":true,\"name\":\"seller\",\"type\":\"address\"}],\"name\":\"PlotSectionSold\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"name\":\"previousOwner\",\"type\":\"address\"},{\"indexed\":true,\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"OwnershipTransferred\",\"type\":\"event\"}]","ContractName":"EthPlot","CompilerVersion":"v0.4.23+commit.124ca40d","OptimizationUsed":"1","Runs":"200","ConstructorArguments":"","Library":"","SwarmSource":"bzzr://3e31a71c74de18be43457a9793a3fac61cd3459998a2c32812b5610485be8176"}]}