{"status":"1","message":"OK","result":[{"SourceCode":"/* Discussion:\r\n * https://github.com/b-u-i-d-l/fair-inflation-v2\r\n */\r\n/* Description:\r\n * A more sustainable economic model for DFO-based Startups to maintain value and funds operations\r\n * AleToschi.eth | Vasapower.eth | CD\r\n * \r\n * White Paper: https://docs.google.com/document/d/1-foU-XTlXS0WgH97IOVC1i-O_WsKeqc-FVL5x9RR7WY/edit?usp=sharing\r\n * \r\n * Document Purpose:\r\n * This document is an update of “A sustainable economic model for DFO-based Startups to maintain value and funds operations” https://drive.google.com/file/d/1_QZr5CjNsQKGxoJ5WkI9iPJGs4PdKWol/ We successfully renamed this mechanism “Fair Inflation V1” (FI V1). During the experimentation of the Fair Inflation V1, the DFOhub Team Researched and Developed a better and more resilient version of the “Fair Inflation V1” called “Fair Inflation V2” (FI V2).\r\n * \r\n * Fair Inflation V1 - White Paper\r\n * FI V1 - Abstract:\r\n * Voting Tokens of Decentralized Flexible Organizations are real programmable equities of a protocol because the funds locked into a DFO wallet are actually funds in the hand of token holders. DFO funds can be transferred or used only by voting, this opens new and very interesting correlations between Private Equity and Tokens.\r\n * \r\n * The core experiment of this paper is to explore how adding new on-chain valuable assets into a DFO wallet can sustain the price of its voting tokens.\r\n * \r\n * In a traditional company, if new assets are added to the Company funds (without any increase of debts) the evaluation of its equities is backed by the value of these assets. This is because equities holders have the power to manage these assets.\r\n * \r\n * This basic rule can be applied to Decentralized Flexible Organizations because if funds are added to a DFO wallet, Token Holders are the only ruler of these funds. This is a basic design decision of The DFO core protocol, because thanks to its Smart contracts, nobody can make actions outside of a public proposal voted by token holders.\r\n * \r\n * FI V1 - The experiment:\r\n * Thanks to the Uniswap math design:\r\n * \r\n * x * y = k. **\r\n * \r\n * **Explained by Decrypt.co In the equation, x and y represent the quantity of ETH and ERC20 tokens available in a liquidity pool and k is a constant value. This equation uses the balance between the ETH and ERC20 tokens–and supply and demand–to determine the price of a particular token. Whenever someone buys Poop Token with ETH, the supply of Poop Token decreases while the supply of ETH increases–the price of Poop Token goes up. As a result, the price of tokens on Uniswap can only change if trades occur. Essentially what Uniswap is doing it balancing out the value of tokens, and the swapping of them based on how much people want to buy and sell them.\r\n * \r\n * A Flexible Organization can sustain its operation by a fixed Circulated Supply inflation using the uniswap protocol, by adding new values into the DFO Wallet:\r\n * \r\n * FI V1 - Example:\r\n * A DFO named “Flexible” with a Voting Token named “FLX”\r\n * \r\n * FLX Total Supply = 1.000.000 FLX Flexible DFO Wallet = 800.000 FLX (80%) FLX Circulating Supply = 200.000 FLX (20%)\r\n * \r\n * With a Smart Contract based proposal, Flexible Token holders decide to step by step inflate the circulating supply for a total of 5% during a period of a year and a half by selling a fixed number of FLX once a week (~ 50.400 Ethereum Blocks @ 12 sec for a block for 80 times)\r\n * \r\n * In this case, the Flexible DFO will sell in total 50.000 FLX on the Uniswap protocol at the ratio of 625 FLX every 50.400 Blocks, increasing the circulating supply by the 0,0625%\r\n * \r\n * (In this experiment technically the FLX backed value is already settled by the 800.000 FLX into the Flexible DFO Wallet, but because the FLX is at the same time the Voting Token, we don’t count its value in this equation.)\r\n * \r\n * Every FLX Inflation event will add new ETH to the Flexible DFO wallet, adding new backed assets.\r\n * \r\n * For example, after the first selling event the new status of the Flexible DFO Wallet will be:\r\n * \r\n * 799375 FLX + Z ETH ***\r\n * \r\n * ***(Z is equal to an amount of ETH depending on the ratio of ETH/FLX into the Uniswap Pool)\r\n * \r\n * Now Z ETH is the minimum backed value of the Flexible DFO Wallet and consequently the FLX Market cap because FLX Token Holders are the only people who can manage these funds, like Equity Holders in a Company.\r\n * \r\n * Every Selling Event the Uniswap Pool reaches very little inflation but at the same time this selling benefits every FLX Holders.\r\n * \r\n * If the DFO Voting Token Holders will use every week an amount < of the 100% of the Z ETH funds reached, the project can pay operations and at the same time accumulate backed value to benefit every token holder.\r\n * \r\n * FI V1 - The DFOhub Experiment:\r\n * We want to do this experiment for three fundamental reasons:\r\n * \r\n * Empiric data about the correlation from Programmable Equities (DFO based Voting Tokens) to Regular Equities that can open an infinite number of questions and business opportunities for the dapps of tomorrow (DFO based) R&D and introduce these standardized Smart Contracts as optional basic functions for every DFO via voting Sustain our operations and at the same time to build a minimum backed valorization for BUIDL holders.\r\n * \r\n * The Economics behind BUIDL is based on the Business Model of the General Purpose Protocol DFO. Every time someone creates a new Decentralized Flexible Organization, a % of the new DFO’s new Voting Tokens is added to the DFOhub Wallet. The DFOhub Wallet is managed only by voting from the BUIDL holders, making assets into the DFOhub wallet the backed value of BUIDL.\r\n * \r\n * FI V1 - DFOhub Experiment in numbers:\r\n * BUIDL Total Supply = 42.000.000 BUIDL DFOhub DFO Wallet = 11.500.000 BUIDL (27.3%) DFOhub Team Operations Wallet = 11.500.000 BUIDL (27.3%) BUIDL Circulating Supply = 2.200.000 BUIDL (5.2%)\r\n * \r\n * With a Smart Contract based proposal, DFOhub will step by step inflate the circulating supply of BUIDL for a total of 0.8% during a period of a year and a half by selling a fixed number of BUIDL once every two weeks (~ 100.800 Ethereum Blocks @ 12 sec for a block for 40 times)\r\n * \r\n * At the same time, the DFOhub Team Operations Wallet will step by step inflate the circulating supply of BUIDL for a total of 0.8% during a period of a year and a half by selling a fixed number of BUIDL once every two weeks (~ 100.800 Ethereum Blocks @ 12 sec for a block for 40 times)\r\n * \r\n * These two Smart Contracts will inflate the circulation supply of a total of 1.6% (672.000 BUIDL) in a year and a half. The funds will be inflated into 3 different Uniswap Pools:\r\n * \r\n * 25% Uniswap V1 ETH/BUIDL | 0.4% (168.000 BUIDL) 25% Uniswap V2 ETH/BUIDL | 0.4% (168.000 BUIDL) 50% Uniswap V2 USDC/BUIDL | 0.8% Inflation (336.000 BUIDL)\r\n * \r\n * During every Selling Event, the Circulating supply of BUIDL will increase by 0.02% (8.400 BUIDL) and will be split into:\r\n * \r\n * 25% Uniswap V1 ETH/BUIDL | 0.005% (2.100 BUIDL) 25% Uniswap V2 ETH/BUIDL | 0.005% (2.100 BUIDL) 50% Uniswap V2 USDC/BUIDL | 0.01% Inflation (4.200 BUIDL)\r\n * \r\n * FI V1 - Conclusion:\r\n * Every Two weeks these funds will create values for BUIDL holders in two different ways:\r\n * \r\n * From the DFOhub Wallet: Z ETH and Z USDC will be automatically added to the DFOhub wallet as a backed value for BUIDL holders. From the DFOhub Team Operations Wallet, these funds will be used to accelerate the R&D into new DFOhub Functionalities, Marketing, and Community Rewards. These Operations will benefit all of the BUIDL holders accelerating the advancement of the protocol and its usage, so more DFO's Voting Tokens into the DFOhub Wallet as a backed value for BUIDL holders.\r\n * \r\n * All of the functionalities related to this R&D will become available for every DFO as Optional Basic Functionalities, to accelerate the exploration of Programmable Equities R&D.\r\n * \r\n * Fair Inflation V2 - White Paper Update:\r\n * FI V2 - Abstract:\r\n * The “Fair Inflation V1” experiment was a success during the first month both in terms of equity between funds for operations and backed funds for BUIDL holders.\r\n * \r\n * You can check the three FI events here:\r\n * \r\n * https://etherscan.io/tx/0x68ef31cc8cff2929295fbd0b84187eb70b59bd1f8efb069f1bd9ed06fe817a15 (DFOhub) https://etherscan.io/tx/0xe31d9eab9527e2a0299b80efc86ee013a0915825aac103246eccfaeddb95d822 (Operation Funds) https://etherscan.io/tx/0xfdc2ab2be2ac2d46f37e520217f6b1ce10c4203ab5d56c512d743878d93f6872 (DFOhub) https://etherscan.io/tx/0xdbf65b725d1d37750f67f6a1801c3cd38121fe676a414576d8ef5c5a19079f46 (Operation Funds)\r\n * \r\n * The “Fair Inflation V1” experiment highlighted three unaddressed points of failure:\r\n * \r\n * Slippage: The Uniswap Slippage is selling 8.400 BUIDL at an untoward price. This can be a problem for DFO-based Startups with less liquidity than BUIDL Dump: The 8400 BUIDL selling created a short dump in the market. This system can be attacked by speculators if they sell BUIDL just before the Fair Inflation event. This kind of attack can harm both BUIDL holders and the team.\r\n * \r\n * FI V2 - The Experiment:\r\n * The “Fair Inflation V2” experiment aims to solve both the Slippage and the Dump problems by transforming weekly inflation events into daily inflation events without changing the quantity of Inflated tokens during the year and a half experiment.\r\n * \r\n * In the “Fair Inflation V1” Every Week the circulating supply of BUIDL is inflated by 8.400 BUIDL for a total of 672.000 BUIDL after 80 weekly events into 3 Uniswap Pools (25% in ETH/BUIDL V1, 25% in ETH/BUIDL V2 and 50% in USDC/BUIDL V2).\r\n * \r\n * In the “Fair Inflation V2” the same amount of BUIDL will be inflated in the same amount of time, but splitted into more inflation events and used to reward liquidity providers to Uniswap pools.\r\n * \r\n * FI V2 - The DFOhub (BUIDL) Experiment:\r\n * DFOhub (https://etherscan.io/tokenHoldings?a=0x5D40c724ba3e7Ffa6a91db223368977C522BdACD) will step by step inflate the circulating supply of BUIDL for a total of 336.000 during a period of a year and a half splitted in 560 daily Inflation Events (6.300 Ethereum Blocks)\r\n * \r\n * This Smart Contract will inflate the circulation supply of a total of 336.000 BUIDL in a year and a half. The funds will be both inflated into 3 different Uniswap Pools and lock them to reward liquidity pool providers :\r\n * \r\n * 30% Uniswap V2 ETH/BUIDL (100.800 BUIDL)\r\n * \r\n * 30% Uniswap V2 USDC/BUIDL (100.800 BUIDL)\r\n * \r\n * 10% Uniswap V2 ARTE/BUIDL (33.600 BUIDL)\r\n * \r\n * 30% Rewards for Liquidity Providers (100.800 BUIDL)\r\n * \r\n * During every Selling Event, the Circulating supply of BUIDL will increase by 600 BUIDL and will be split into:\r\n * \r\n * 30% Uniswap V2 ETH/BUIDL (180 BUIDL)\r\n * \r\n * 30% Uniswap V2 USDC/BUIDL (180 BUIDL)\r\n * \r\n * 10% Uniswap V2 ARTE/BUIDL (60 BUIDL)\r\n * \r\n * 30% Rewards for Liquidity Providers (180 BUIDL)\r\n * \r\n * At the same time, the DFOhub Team Operations DFO Wallet (https://etherscan.io/tokenHoldings?a=0x25756f9C2cCeaCd787260b001F224159aB9fB97A) will step by step inflate the circulating supply of BUIDL for a total of 336.000 BUIDL during a period of a year and a half splitted in 560 daily Inflation Events (6.300 Ethereum Blocks)\r\n * \r\n * This Smart Contract will inflate the circulation supply of a total of 336.000 BUIDL in a year and a half. The funds will be both inflated into 3 different Uniswap Pools:\r\n * \r\n * 50% Uniswap V2 ETH/BUIDL (168.000 BUIDL)\r\n * \r\n * 50% Uniswap V2 USDC/BUIDL (168.000 BUIDL)\r\n * \r\n * During every Selling Event, the Circulating supply of BUIDL will increase by 600 BUIDL and will be split into:\r\n * \r\n * 50% Uniswap V2 ETH/BUIDL (300 BUIDL)\r\n * \r\n * 50% Uniswap V2 USDC/BUIDL (300 BUIDL)\r\n * \r\n * These two Smart Contracts will inflate the circulation supply of a total of 672.000 BUIDL in a year and a half.\r\n * \r\n * The DFOhub FI and the Operation FI will occur at ~ 12 hours apart (3.150 Ethereum Blocks).\r\n * \r\n * FI V2 - The ethart (ARTE) Experiment:\r\n * Ethart Fair Inflation V1\r\n * (https://github.com/b-u-i-d-l/ethArt): A sustainable economic model for DFO-based startups to maintain value and fund operations | ethArt version For the $ARTE experiment, we will inflate the circulating supply by 1.21% (121,000) of the total supply (10,000,000) over one year..\r\n * \r\n * Inflation events will occur once a week (every 50,000 ETH Blocks) across two Uniswap pairs for a total of 2,200 $ARTE each time:\r\n * \r\n * Uniswap V2 $ETH/$ARTE (1,100 $ARTE Every Week) 0.01% Weekly Inflation\r\n * Uniswap V2 $BUIDL/$ARTE (1,100 $ARTE Every Week) 0.01% Weekly Inflation\r\n * For a total of 2,200 $ARTE every week (0.02%)\r\n * \r\n * Ethart Fair Inflation V2:\r\n * From the DFOhub Team Operations DFO Wallet (https://etherscan.io/tokenHoldings?a=0x25756f9C2cCeaCd787260b001F224159aB9fB97A)\r\n * \r\n * Inflation events will occur once a day (every 6,300 ETH Blocks) across two Uniswap pairs for a total of 314 $ARTE each time:\r\n * \r\n * Uniswap V2 $ETH/$ARTE (157 $ARTE Every Day)\r\n * \r\n * Uniswap V2 $BUIDL/$ARTE (157 $ARTE Every Day)\r\n * \r\n * For a total of 314 $ARTE every day\r\n * \r\n  * FI V2 - The UniFi (UniFi) Experiment:\r\n * From the DFOhub Team Operations DFO Wallet (https://etherscan.io/tokenHoldings?a=0x25756f9C2cCeaCd787260b001F224159aB9fB97A)\r\n * \r\n * Inflation events will occur once a day (every 6,300 ETH Blocks) across two Uniswap pairs for a total of 4,900 $UniFi each time:\r\n * \r\n * Uniswap V2 $ETH/$UniFi (2,695 $UniFi Every Day)\r\n * \r\n * Uniswap V2 $USDC/$UniFi (1,470 $UniFi Every Day)\r\n * \r\n * Uniswap V2 $BUIDL/$UniFi (735 $UniFi Every Day)\r\n * \r\n * For a total of 4,900 $UniFi every day\r\n * \r\n * All of the functionalities related to this R&D will become available for every DFO as Optional Basic Functionalities, to accelerate the exploration of Programmable Equities R&D.\r\n */\r\npragma solidity ^0.7.0;\r\n\r\ncontract NERVFairInflationV2 {\r\n\r\n    //Functionality Set-UP\r\n    //This mandatory method is called by the proxy just after the proposal finalization.\r\n    //It sets-up all the stuff to let this functionality work properly\r\n    function onStart(address, address) public {\r\n        //The Proxy is the main Contract of the DFO Protocol\r\n        IMVDProxy proxy = IMVDProxy(msg.sender);\r\n\r\n        //StateHolder is the Database of every DFO, so let's store all the above stuff\r\n        IStateHolder stateHolder = IStateHolder(proxy.getStateHolderAddress());\r\n\r\n        //The buidl token address, needed for the swap operations\r\n        stateHolder.setAddress(\"buidlTokenAddress\", 0x7b123f53421b1bF8533339BFBdc7C98aA94163db);\r\n\r\n        //The arte token address, needed for the swap operations\r\n        stateHolder.setAddress(\"arteTokenAddress\", 0x34612903Db071e888a4dADcaA416d3EE263a87b9);\r\n\r\n        //The unifi token address, needed for the swap operations\r\n        stateHolder.setAddress(\"unifiTokenAddress\", 0x9E78b8274e1D6a76a0dBbf90418894DF27cBCEb5);\r\n\r\n        //The well-known USDC Contract Token\r\n        stateHolder.setAddress(\"uSDCTokenAddress\", 0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48);\r\n\r\n        //The Smart Contract Address to locate the Uniswap V2 Exchanges\r\n        stateHolder.setAddress(\"uniswapV2RouterAddress\", 0x7a250d5630B4cF539739dF2C5dAcb4c659F2488D);\r\n\r\n        //When I can call this Function? Every day (expressed in Ethereum Blocks)\r\n        stateHolder.setUint256(\"swapBlockLimit\", 6300);\r\n\r\n        //How many buidl tokens to swap for ETH in UniswapV2 every day? 300\r\n        stateHolder.setUint256(\"buidlAmountToSwapForEtherInV2\", 300000000000000000000);\r\n\r\n        //How many buidl tokens to swap for USDC in UniswapV2 every day? 300\r\n        stateHolder.setUint256(\"buidlAmountToSwapForUSDCInV2\", 300000000000000000000);\r\n\r\n        //How many arte tokens to swap for ETH in UniswapV2 every day? 157\r\n        stateHolder.setUint256(\"arteAmountToSwapForEtherInV2\", 157000000000000000000);\r\n\r\n        //How many arte tokens to swap for buidl in UniswapV2 every day? 157\r\n        stateHolder.setUint256(\"arteAmountToSwapForBuidlInV2\", 157000000000000000000);\r\n\r\n        //How many unifi tokens to swap for ETH in UniswapV2 every day? 2695\r\n        stateHolder.setUint256(\"unifiAmountToSwapForEtherInV2\", 2695000000000000000000);\r\n\r\n        //How many unifi I have to swap for USDC in UniswapV2 every day? 1470\r\n        stateHolder.setUint256(\"unifiAmountToSwapForUSDCInV2\", 1470000000000000000000);\r\n\r\n        //How many unifi I have to swap for buidl in UniswapV2 evey day? 735\r\n        stateHolder.setUint256(\"unifiAmountToSwapForBuidlInV2\", 735000000000000000000);\r\n\r\n        //Do you want to start from a specific swap block?\r\n        stateHolder.setUint256(\"lastSwapBlock\", 10733885);\r\n    }\r\n\r\n    //Function Teardown - This mandatory operation is called by the Proxy before disabling the Function (e.g. for a Proposal to update it with a new one)\r\n    //In this case, the state holder will be cleaned by useless data to keep the storage clean\r\n    function onStop(address) public {\r\n        IStateHolder stateHolder = IStateHolder(IMVDProxy(msg.sender).getStateHolderAddress());\r\n        stateHolder.clear(\"buidlTokenAddress\");\r\n        stateHolder.clear(\"arteTokenAddress\");\r\n        stateHolder.clear(\"unifiTokenAddress\");\r\n        stateHolder.clear(\"uSDCTokenAddress\");\r\n        stateHolder.clear(\"uniswapV2RouterAddress\");\r\n        stateHolder.clear(\"swapBlockLimit\");\r\n        stateHolder.clear(\"buidlAmountToSwapForEtherInV2\");\r\n        stateHolder.clear(\"buidlAmountToSwapForUSDCInV2\");\r\n        stateHolder.clear(\"arteAmountToSwapForEtherInV2\");\r\n        stateHolder.clear(\"arteAmountToSwapForBuidlInV2\");\r\n        stateHolder.clear(\"unifiAmountToSwapForEtherInV2\");\r\n        stateHolder.clear(\"unifiAmountToSwapForUSDCInV2\");\r\n        stateHolder.clear(\"unifiAmountToSwapForBuidlInV2\");\r\n        stateHolder.clear(\"lastSwapBlock\");\r\n    }\r\n\r\n    //The real main inflation function.\r\n    //This is a public one, callable from any one (Team members or random guys it's not important)\r\n    //All the rules will decide if it can be executed or not\r\n    function fairInflation() public {\r\n        //Load the Proxy and the State Holder\r\n        IMVDProxy proxy = IMVDProxy(msg.sender);\r\n        IStateHolder stateHolder = IStateHolder(proxy.getStateHolderAddress());\r\n\r\n        //Are you calling it after two weeks since last time?\r\n        require(block.number >= (stateHolder.getUint256(\"lastSwapBlock\") + stateHolder.getUint256(\"swapBlockLimit\")), \"Too early to swap new Tokens!\");\r\n\r\n        //Save the last time you called it\r\n        stateHolder.setUint256(\"lastSwapBlock\", block.number);\r\n\r\n        //Where to store ETH, USDC and buidl?\r\n        address dfoWalletAddress = proxy.getMVDWalletAddress();\r\n\r\n        //Get the buidl Token\r\n        IERC20 buidlToken = IERC20(stateHolder.getAddress(\"buidlTokenAddress\"));\r\n\r\n        IUniswapV2Router uniswapV2Router = IUniswapV2Router(stateHolder.getAddress(\"uniswapV2RouterAddress\"));\r\n\r\n        address wethTokenAddress = uniswapV2Router.WETH();\r\n\r\n        _swapBuidl(proxy, stateHolder, buidlToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n\r\n        _swapArte(proxy, stateHolder, buidlToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n\r\n        _swapUnifi(proxy, stateHolder, buidlToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n    }\r\n\r\n    function _swapBuidl(IMVDProxy proxy, IStateHolder stateHolder, IERC20 buidlToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n        //How many buidl I have to swap for ETH in UniswapV2?\r\n        uint256 buidlAmountToSwapForEtherInV2 = stateHolder.getUint256(\"buidlAmountToSwapForEtherInV2\");\r\n\r\n        //How many buidl I have to swap for USDC in UniswapV2?\r\n        uint256 buidlAmountToSwapForUSDCInV2 = stateHolder.getUint256(\"buidlAmountToSwapForUSDCInV2\");\r\n\r\n        //Send the correct cumulative amount of budil tokens to swap from the DFO to this function, to let it spend them in Uniswap V2\r\n        proxy.transfer(address(this), buidlAmountToSwapForEtherInV2 + buidlAmountToSwapForUSDCInV2, address(buidlToken));\r\n\r\n        //Swap buidl for ETH and USDC in UniswapV2\r\n        _uniswapV2Buidl(stateHolder, buidlAmountToSwapForEtherInV2, buidlAmountToSwapForUSDCInV2, buidlToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n    }\r\n\r\n    //Swap buidl for ETH and USDC in UniswapV2\r\n    function _uniswapV2Buidl(IStateHolder stateHolder, uint256 buidlAmountToSwapForEtherInV2, uint256 buidlAmountToSwapForUSDCInV2, IERC20 buidlToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n        //Do I have something to swap in UniswapV2?\r\n        if(buidlAmountToSwapForEtherInV2 <= 0 && buidlAmountToSwapForUSDCInV2 <= 0) {\r\n            return;\r\n        }\r\n\r\n        //\"Unlock\" - Enable UniswapV2 to spend my buidl tokens, if necessary\r\n        if(buidlToken.allowance(address(this), address(uniswapV2Router)) == 0) {\r\n            buidlToken.approve(address(uniswapV2Router), 0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff);\r\n        }\r\n\r\n        address[] memory path = new address[](2);\r\n        path[0] = address(buidlToken);\r\n\r\n        //Swap the desired amount of buidl and send gained ETHs to the DFO's Wallet, if any\r\n        if(buidlAmountToSwapForEtherInV2 > 0) {\r\n            path[1] = wethTokenAddress;\r\n            uniswapV2Router.swapExactTokensForETH(buidlAmountToSwapForEtherInV2, uniswapV2Router.getAmountsOut(buidlAmountToSwapForEtherInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n\r\n        //Swap the desired amount of buidl and send gained USDCs to the DFO's Wallet, if any\r\n        if(buidlAmountToSwapForUSDCInV2 > 0) {\r\n            path[1] = stateHolder.getAddress(\"uSDCTokenAddress\");\r\n            uniswapV2Router.swapExactTokensForTokens(buidlAmountToSwapForUSDCInV2, uniswapV2Router.getAmountsOut(buidlAmountToSwapForUSDCInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n    }\r\n\r\n    function _swapArte(IMVDProxy proxy, IStateHolder stateHolder, IERC20 buidlToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n\r\n        //Get the arte Token\r\n        IERC20 arteToken = IERC20(stateHolder.getAddress(\"arteTokenAddress\"));\r\n\r\n        //How many arte I have to swap for ETH in UniswapV2?\r\n        uint256 arteAmountToSwapForEtherInV2 = stateHolder.getUint256(\"arteAmountToSwapForEtherInV2\");\r\n\r\n        //How many arte I have to swap for buidl in UniswapV2?\r\n        uint256 arteAmountToSwapForBuidlInV2 = stateHolder.getUint256(\"arteAmountToSwapForBuidlInV2\");\r\n\r\n        //Send the correct cumulative amount of arte tokens to swap from the DFO to this function, to let it spend them in Uniswap V2\r\n        proxy.transfer(address(this), arteAmountToSwapForEtherInV2 + arteAmountToSwapForBuidlInV2, address(arteToken));\r\n\r\n        //Swap arte for ETH and buidl in UniswapV2\r\n        _uniswapV2Arte(arteAmountToSwapForEtherInV2, arteAmountToSwapForBuidlInV2, buidlToken, arteToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n    }\r\n\r\n    //Swap arte for ETH and buidl in UniswapV2\r\n    function _uniswapV2Arte(uint256 arteAmountToSwapForEtherInV2, uint256 arteAmountToSwapForBuidlInV2, IERC20 buidlToken, IERC20 arteToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n        //Do I have something to swap in UniswapV2?\r\n        if(arteAmountToSwapForEtherInV2 <= 0 && arteAmountToSwapForBuidlInV2 <= 0) {\r\n            return;\r\n        }\r\n\r\n        //\"Unlock\" - Enable UniswapV2 to spend my arte tokens, if necessary\r\n        if(arteToken.allowance(address(this), address(uniswapV2Router)) == 0) {\r\n            arteToken.approve(address(uniswapV2Router), 0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff);\r\n        }\r\n\r\n        address[] memory path = new address[](2);\r\n        path[0] = address(arteToken);\r\n\r\n        //Swap the desired amount of arte and send gained ETHs to the DFO's Wallet, if any\r\n        if(arteAmountToSwapForEtherInV2 > 0) {\r\n            path[1] = wethTokenAddress;\r\n            uniswapV2Router.swapExactTokensForETH(arteAmountToSwapForEtherInV2, uniswapV2Router.getAmountsOut(arteAmountToSwapForEtherInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n\r\n        //Swap the desired amount of arte and send gained buidls to the DFO's Wallet, if any\r\n        if(arteAmountToSwapForBuidlInV2 > 0) {\r\n            path[1] = address(buidlToken);\r\n            uniswapV2Router.swapExactTokensForTokens(arteAmountToSwapForBuidlInV2, uniswapV2Router.getAmountsOut(arteAmountToSwapForBuidlInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n    }\r\n\r\n    function _swapUnifi(IMVDProxy proxy, IStateHolder stateHolder, IERC20 buidlToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n\r\n        //Get the unifi Token\r\n        IERC20 unifiToken = IERC20(stateHolder.getAddress(\"unifiTokenAddress\"));\r\n\r\n        //How many unifi I have to swap for ETH in UniswapV2?\r\n        uint256 unifiAmountToSwapForEtherInV2 = stateHolder.getUint256(\"unifiAmountToSwapForEtherInV2\");\r\n\r\n        //How many unifi I have to swap for USDC in UniswapV2?\r\n        uint256 unifiAmountToSwapForUSDCInV2 = stateHolder.getUint256(\"unifiAmountToSwapForUSDCInV2\");\r\n\r\n        //How many unifi I have to swap for buidl in UniswapV2?\r\n        uint256 unifiAmountToSwapForBuidlInV2 = stateHolder.getUint256(\"unifiAmountToSwapForBuidlInV2\");\r\n\r\n        //Send the correct cumulative amount of unifi tokens to swap from the DFO to this function, to let it spend them in Uniswap V2\r\n        proxy.transfer(address(this), unifiAmountToSwapForEtherInV2 + unifiAmountToSwapForUSDCInV2 + unifiAmountToSwapForBuidlInV2, address(unifiToken));\r\n\r\n        //Swap unifi for ETH and USDC and buidl in UniswapV2\r\n        _uniswapV2Unifi(stateHolder, unifiAmountToSwapForEtherInV2, unifiAmountToSwapForUSDCInV2, unifiAmountToSwapForBuidlInV2, buidlToken, unifiToken, uniswapV2Router, wethTokenAddress, dfoWalletAddress);\r\n    }\r\n\r\n    //Swap unifi for ETH, USDC and buidl in UniswapV2\r\n    function _uniswapV2Unifi(IStateHolder stateHolder, uint256 unifiAmountToSwapForEtherInV2, uint256 unifiAmountToSwapForUSDCInV2, uint256 unifiAmountToSwapForBuidlInV2, IERC20 buidlToken, IERC20 unifiToken, IUniswapV2Router uniswapV2Router, address wethTokenAddress, address dfoWalletAddress) private {\r\n        //Do I have something to swap in UniswapV2?\r\n        if(unifiAmountToSwapForEtherInV2 <= 0 && unifiAmountToSwapForUSDCInV2 <= 0 && unifiAmountToSwapForBuidlInV2 <= 0) {\r\n            return;\r\n        }\r\n\r\n        //\"Unlock\" - Enable UniswapV2 to spend my unifi tokens, if necessary\r\n        if(unifiToken.allowance(address(this), address(uniswapV2Router)) == 0) {\r\n            unifiToken.approve(address(uniswapV2Router), 0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff);\r\n        }\r\n\r\n        address[] memory path = new address[](2);\r\n        path[0] = address(unifiToken);\r\n\r\n        //Swap the desired amount of unifi and send gained ETHs to the DFO's Wallet, if any\r\n        if(unifiAmountToSwapForEtherInV2 > 0) {\r\n            path[1] = wethTokenAddress;\r\n            uniswapV2Router.swapExactTokensForETH(unifiAmountToSwapForEtherInV2, uniswapV2Router.getAmountsOut(unifiAmountToSwapForEtherInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n\r\n        //Swap the desired amount of unifi and send gained USDCs to the DFO's Wallet, if any\r\n        if(unifiAmountToSwapForUSDCInV2 > 0) {\r\n            path[1] = stateHolder.getAddress(\"uSDCTokenAddress\");\r\n            uniswapV2Router.swapExactTokensForTokens(unifiAmountToSwapForUSDCInV2, uniswapV2Router.getAmountsOut(unifiAmountToSwapForUSDCInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n\r\n        //Swap the desired amount of unifi and send gained buidls to the DFO's Wallet, if any\r\n        if(unifiAmountToSwapForBuidlInV2 > 0) {\r\n            path[1] = address(buidlToken);\r\n            uniswapV2Router.swapExactTokensForTokens(unifiAmountToSwapForBuidlInV2, uniswapV2Router.getAmountsOut(unifiAmountToSwapForBuidlInV2, path)[1], path, dfoWalletAddress, block.timestamp + 1000);\r\n        }\r\n    }\r\n}\r\n\r\ninterface IUniswapV2Router {\r\n    function WETH() external pure returns (address);\r\n    function getAmountsOut(uint amountIn, address[] calldata path) external view returns (uint[] memory amounts);\r\n    function swapExactTokensForETH(uint amountIn, uint amountOutMin, address[] calldata path, address to, uint deadline) external returns (uint[] memory amounts);\r\n    function swapExactTokensForTokens(uint amountIn, uint amountOutMin, address[] calldata path, address to, uint deadline) external returns (uint[] memory amounts);\r\n}\r\n\r\ninterface IMVDProxy {\r\n    function getToken() external view returns(address);\r\n    function getStateHolderAddress() external view returns(address);\r\n    function getMVDWalletAddress() external view returns(address);\r\n    function transfer(address receiver, uint256 value, address token) external;\r\n}\r\n\r\ninterface IStateHolder {\r\n    function setUint256(string calldata name, uint256 value) external returns(uint256);\r\n    function getUint256(string calldata name) external view returns(uint256);\r\n    function getAddress(string calldata name) external view returns(address);\r\n    function setAddress(string calldata varName, address val) external returns (address);\r\n    function clear(string calldata varName) external returns(string memory oldDataType, bytes memory oldVal);\r\n}\r\n\r\ninterface IERC20 {\r\n    function allowance(address owner, address spender) external view returns (uint256);\r\n    function approve(address spender, uint256 amount) external returns (bool);\r\n}","ABI":"[{\"inputs\":[],\"name\":\"fairInflation\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"name\":\"onStart\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"name\":\"onStop\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"}]","ContractName":"NERVFairInflationV2","CompilerVersion":"v0.7.0+commit.9e61f92b","OptimizationUsed":"1","Runs":"200","ConstructorArguments":"","EVMVersion":"Default","Library":"","LicenseType":"MIT","Proxy":"0","Implementation":"","SwarmSource":"ipfs://b083d59094493ea579b96fd699c2c2b8cbba499c91c66f6fcd3dde1ba120e1e6"}]}