{"status":"1","message":"OK","result":[{"SourceCode":"//\r\n//                 ,/\r\n//               ,'/\r\n//             ,' /\r\n//           ,'  /_____,\r\n//         .'____    ,'\r\n//              /  ,'\r\n//             / ,'\r\n//            /,'\r\n//           /'\r\n//\r\n// Ascii art made by Evan M Corcoran\r\n//\r\n// A full explanation of the protocol can be found at https://github.com/corollari/ln2tBTC/blob/master/README.md\r\n\r\n// SPDX-License-Identifier: MIT\r\npragma solidity ^0.6.0;\r\n\r\n/**\r\n * @dev Interface of the ERC20 standard as defined in the EIP.\r\n */\r\ninterface IERC20 {\r\n    /**\r\n     * @dev Returns the amount of tokens in existence.\r\n     */\r\n    function totalSupply() external view returns (uint256);\r\n\r\n    /**\r\n     * @dev Returns the amount of tokens owned by `account`.\r\n     */\r\n    function balanceOf(address account) external view returns (uint256);\r\n\r\n    /**\r\n     * @dev Moves `amount` tokens from the caller's account to `recipient`.\r\n     *\r\n     * Returns a boolean value indicating whether the operation succeeded.\r\n     *\r\n     * Emits a {Transfer} event.\r\n     */\r\n    function transfer(address recipient, uint256 amount) external returns (bool);\r\n\r\n    /**\r\n     * @dev Returns the remaining number of tokens that `spender` will be\r\n     * allowed to spend on behalf of `owner` through {transferFrom}. This is\r\n     * zero by default.\r\n     *\r\n     * This value changes when {approve} or {transferFrom} are called.\r\n     */\r\n    function allowance(address owner, address spender) external view returns (uint256);\r\n\r\n    /**\r\n     * @dev Sets `amount` as the allowance of `spender` over the caller's tokens.\r\n     *\r\n     * Returns a boolean value indicating whether the operation succeeded.\r\n     *\r\n     * IMPORTANT: Beware that changing an allowance with this method brings the risk\r\n     * that someone may use both the old and the new allowance by unfortunate\r\n     * transaction ordering. One possible solution to mitigate this race\r\n     * condition is to first reduce the spender's allowance to 0 and set the\r\n     * desired value afterwards:\r\n     * https://github.com/ethereum/EIPs/issues/20#issuecomment-263524729\r\n     *\r\n     * Emits an {Approval} event.\r\n     */\r\n    function approve(address spender, uint256 amount) external returns (bool);\r\n\r\n    /**\r\n     * @dev Moves `amount` tokens from `sender` to `recipient` using the\r\n     * allowance mechanism. `amount` is then deducted from the caller's\r\n     * allowance.\r\n     *\r\n     * Returns a boolean value indicating whether the operation succeeded.\r\n     *\r\n     * Emits a {Transfer} event.\r\n     */\r\n    function transferFrom(address sender, address recipient, uint256 amount) external returns (bool);\r\n\r\n    /**\r\n     * @dev Emitted when `value` tokens are moved from one account (`from`) to\r\n     * another (`to`).\r\n     *\r\n     * Note that `value` may be zero.\r\n     */\r\n    event Transfer(address indexed from, address indexed to, uint256 value);\r\n\r\n    /**\r\n     * @dev Emitted when the allowance of a `spender` for an `owner` is set by\r\n     * a call to {approve}. `value` is the new allowance.\r\n     */\r\n    event Approval(address indexed owner, address indexed spender, uint256 value);\r\n}\r\n\r\n// We are not using SafeMath because there's no operation in the contract where an overflow/underflow can cause problems\r\n// More concretely, there are only two functions in the contract that can overflow/underflow, `addFees` and `removeFees`\r\n// and the results of these functions are not trusted through the contract\r\ncontract LN2tBTC {\r\n\r\n\t// ---------------------------------------------------------------\r\n\t// OPERATORS\r\n\t// ---------------------------------------------------------------\r\n\t// All the functions that are meant to be called by operators have their names prefixed with `operator`\r\n\r\n\t// All of this information could be stored off-chain, but then we would need a way for users to discover the operators available.\r\n\t// To achieve that we would need to build a decentralized and uncensorable list of operators, which would be really hard,\r\n\t// as the operators are incentivized to prevent users from finding out about other operators.\r\n\t// It would also be possible to store only a few bits on-chain and the rest off-chain, but given that this is only a one-time cost for operators,\r\n\t// the cost difference is negligible and doing that would probably harm user UX, I believe it's best to store this info on-chain.\r\n\t// Moving this info off-chain may be re-evaluated in the future tho, as it would allow for things such as custom algorithms for setting the fees\r\n\tstruct Operator {\r\n\t\t// URL of a public HTTP server that is used to exchange data off-chain between operator and user.\r\n\t\tstring publicUrl;\r\n\t\t// Balance in tBTC (held in the contract to prevent operators from providing fake data).\r\n\t\t// It may seem like holding all the balance in the contract increases the risks for the operators, as if the contract gets hacked\r\n\t\t// they would lose all the funds they have parked there instead of only the funds currently being used in trades.\r\n\t\t// However, if a hacker found an exploit they could make operators put all their money in swap operations (by starting swaps),\r\n\t\t// so there's no real difference in risk (operators are also free to only keep the amount currently used in swaps in the contract).\r\n\t\t// On the other side, this makes it much harder for operators to grief users, so that's a good thign to have while\r\n\t\t// a better anti-user-griefing system is developed (see the section on griefing on README.md for more info).\r\n\t\tuint tBTCBalance;\r\n\t\t// Balance in BTC held by the operator on the Lightning network\r\n\t\t// There's no verification performed on this data point\r\n\t\t// Even if we built a proof system that checked this we would have trouble\r\n\t\t// dealing with the unknown capacity limitation on the LN channels that connect user and operator\r\n\t\tuint lnBalance;\r\n\t\t// Just a simple bool that will be used to check if an item already exists in a mapping\r\n\t\t// Will always be set to true on creation\r\n\t\tbool exists;\r\n\t\t// A fee imposed by the provider that increases linearly with the value of the swap\r\n\t\t// It will be multiplied by the swapped amount and divided by 10^8 to obtain the fee that will be charged to the user\r\n\t\tuint linearFee;\r\n\t\t// A constant fee charged by the provider that will just be added to the value requested\r\n\t\tuint constantFee;\r\n\t\t// totalFee = (amount*linearFee)/10^8 + constantFee\r\n\t}\r\n\r\n\t// The denominator against which linear fees will be divided\r\n\t// It's necessary for doing floating-point arithmetic using EVM's integer arithmetic\r\n\t// Conversion: a fee of 0.1% would be 0.1*linearFeeDenominator/100\r\n\tuint constant linearFeeDenominator = 10**8;\r\n\t// Bitcoin uses 8 decimals but tBTC uses 18, this should be corrected\r\n\tuint constant tBTCDenominator = 10**10;\r\n\r\n\t// Contains all operator info addressed by operator address\r\n\t// Used by users in conjuction with `operatorList` to search for operators\r\n\tmapping (address => Operator) public operators;\r\n\t// List of operators, used by users to find the best operator for a swap\r\n\taddress[] public operatorList;\r\n\t// ERC20 tBTC contract (vending machine)\r\n\tIERC20 tBTContract = IERC20(0x8dAEBADE922dF735c38C80C7eBD708Af50815fAa);\r\n\r\n\t// Register a new operator\r\n\t// Must only be called once by the operator itself when it starts operating\r\n\t// Requires a previous approve() call to the ERC20 tBTC contract to allow the token transfer\r\n\tfunction operatorRegister(uint tBTCBalance, uint lnBalance, uint linearFee, uint constantFee, string memory publicUrl) public {\r\n\t\trequire(operators[msg.sender].exists==false, \"Operator has already been registered before\");\r\n\t\toperators[msg.sender] = Operator(publicUrl, tBTCBalance, lnBalance, true, linearFee, constantFee);\r\n\t\tif(tBTCBalance > 0){\r\n\t\t\ttBTContract.transferFrom(msg.sender, address(this), tBTCBalance);\r\n\t\t}\r\n\t\toperatorList.push(msg.sender);\r\n\t}\r\n\r\n\t// Returns the length of the `operatorList` array\r\n\t// Used by clients to iterate over the operators when searching for the lowest fees\r\n\tfunction getOperatorListLength() view public returns(uint length){\r\n\t\treturn operatorList.length;\r\n\t}\r\n\r\n\t// Simple withdraw operation for the ERC20 tBTC tokens held in the contract in behalf of an operator\r\n\tfunction operatorWithdrawTBTC(uint amount) public returns(bool){\r\n\t\tOperator storage op = operators[msg.sender];\r\n\t\trequire(op.tBTCBalance >= amount);\r\n\t\top.tBTCBalance -= amount;\r\n\t\ttBTContract.transfer(msg.sender, amount);\r\n\t\treturn true;\r\n\t}\r\n\r\n\t// Simple deposit operation\r\n\t// Requires a previous approve() call to the ERC20 tBTC contract to allow the token transfer\r\n\tfunction operatorDepositTBTC(uint amount) public returns(bool){\r\n\t\tOperator storage op = operators[msg.sender];\r\n\t\trequire(op.exists == true); // Not needed, just there to make sure people don't lose money\r\n\t\top.tBTCBalance += amount;\r\n\t\ttBTContract.transferFrom(msg.sender, address(this), amount);\r\n\t\treturn true;\r\n\t}\r\n\r\n\t// Set the fees of the operator calling the function\r\n\tfunction operatorSetFees(uint newLinearFee, uint newConstantFee) public {\r\n\t\toperators[msg.sender].linearFee = newLinearFee;\r\n\t\toperators[msg.sender].constantFee = newConstantFee;\r\n\t}\r\n\r\n\t// Set the amount of LN-bound BTC that the operator makes available\r\n\t// This number is completely unverified and can be faked\r\n\tfunction operatorSetLNBalance(uint newLNBalance) public {\r\n\t\toperators[msg.sender].lnBalance = newLNBalance;\r\n\t}\r\n\r\n\t// Set the url of the operator node\r\n\tfunction operatorSetPublicUrl(string memory newUrl) public {\r\n\t\toperators[msg.sender].publicUrl = newUrl;\r\n\t}\r\n\r\n\t// ---------------------------------------------------------------\r\n\t// tBTC -> LN SWAPS\r\n\t// ---------------------------------------------------------------\r\n\t// TODO: Move some steps off-chain to lower the cost and make the whole process faster (no need to wait for confirmations)\r\n\t// This is harder that it seems because you have to avoid impersonation attacks from other users\r\n\t// (eg: A locks tBTC and B sends to the operator an invoice that pays to B, the operator won't be able to tell which invoice is the right one: A's or B's)\r\n\t// To prevent these attacks, an authentication system must be put in place, but the obvious solutions all have downsides:\r\n\t//   - Signing the message with metamask requires an additional step for the user -> worse UX\r\n\t//   - Creating an ephemeral key in the browser can cause problems if the history is deleted mid-swap and it involves extra data (pubkey) sent on txs\r\n\t// So I'm still unsure on what's the best solution for this.\r\n\r\n\t// Time it takes for a step of the swap to time out if the counter-party is unresponsive\r\n\t// Constant chosen arbitrarily\r\n\tuint public timeoutPeriod = 1 hours;\r\n\r\n\tstruct TBTC2LNSwap {\r\n\t\t// Provider that is serving the swap\r\n\t\taddress provider;\r\n\t\t// Amount of tBTC that is locked in the swap\r\n\t\t// A value of 0 is used to represent that the swap has been finalized\r\n\t\tuint tBTCAmount;\r\n\t\t// Timestamp of the moment the swap will time out\r\n\t\t// Always set to `now + lockTime` on creation, where lockTime is the maximum swap duration as set by the user\r\n\t\t// This field is also used to check for struct existence by comparing it against 0\r\n\t\tuint timeoutTimestamp;\r\n\t}\r\n\r\n\t// A double mapping is used for the following reasons:\r\n\t//   - It splits the storage spaces of different users, preventing attacks where one user can front-run another user's txs to prevent them from creating a swap\r\n\t//   - The space of each user is indexed using a unique identifier, in this case the paymentHash (which must be unique, otherwise it's pre-image may be public)\r\n\t// This allows a user to have multiple swaps running concurrently while preventing attacks\r\n\tmapping (address => mapping (bytes32 => TBTC2LNSwap)) public tbtcSwaps;\r\n\r\n\t// Event fired when a new tBTC->LN swap process has been started\r\n\tevent TBTC2LNSwapCreated(bytes32 paymentHash, uint amount, address userAddress, address providerAddress, uint lockTime, string invoice);\r\n\r\n\t// TODO: Send LN invoice to operator through an off-chain medium to lower costs (not by much tho)\r\n\t// Create a new swap from tBTC to LN, locking the tBTC tokens required from the swap in the contract\r\n\t// Requires a previous approve() call to the ERC20 tBTC contract to allow the token transfer\r\n\t// Note that this function doesn't reduce the `tBTCBalance` of the provider, as doing otherwise would open the provider to griefing attacks,\r\n\t// so, if two users create swaps concurrently, a provider may not have enough liquidity to serve both of them\r\n\t// This can be solved by having the users listen to the `TBTC2LNSwapCreated` events emitted by the contract\r\n\tfunction createTBTC2LNSwap(bytes32 paymentHash, uint amount, address providerAddress, uint lockTime, string memory invoice) public {\r\n\t\trequire(tbtcSwaps[msg.sender][paymentHash].timeoutTimestamp == 0, \"Swap already exists\");\r\n\t\ttbtcSwaps[msg.sender][paymentHash] = TBTC2LNSwap(providerAddress, amount, now + lockTime);\r\n\t\ttBTContract.transferFrom(msg.sender, address(this), amount);\r\n\t\temit TBTC2LNSwapCreated(paymentHash, amount, msg.sender, providerAddress, lockTime, invoice);\r\n\t}\r\n\r\n\t// Reverts a swap, returning the locked tBTC tokens to the user, if the pre-image hasn't been revealed within 1 hour of swap creation\r\n\t// This could happen because either the operator is unresponsive and hasn't paid the invoice on time\r\n\t// or because the user hasn't revealed the pre-image before the timeout\r\n\t// (it could also happen if the operator malfunctions and doesn't claim it's payment after the swap, but this should never happen)\r\n\tfunction revertTBTC2LNSwap(bytes32 paymentHash) public {\r\n\t\tTBTC2LNSwap storage swap = tbtcSwaps[msg.sender][paymentHash];\r\n\t\trequire(swap.timeoutTimestamp != 0, \"Swap doesn't exist\");\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap has already been finalized\");\r\n\t\trequire(swap.timeoutTimestamp < now, \"Swap hasn't timed out yet\");\r\n\t\tuint tBTCAmount = swap.tBTCAmount;\r\n\t\tswap.tBTCAmount = 0;\r\n\t\ttBTContract.transfer(msg.sender, tBTCAmount);\r\n\t}\r\n\r\n\t// Finalizes a successful swap by transferring the locked tBTC tokens to the operator\r\n\t// This is called by the swap operator and requires the preimage of the HTLC used in the lightning invoice,\r\n\t// which is revealed when the invoice is accepted by the user's wallet/node\r\n\tfunction operatorClaimPayment(address userAddress, bytes32 paymentHash, bytes memory preimage) public {\r\n\t\tTBTC2LNSwap storage swap = tbtcSwaps[userAddress][paymentHash];\r\n\t\trequire(swap.provider == msg.sender, \"Swap doesn't use this provider or doesn't exist at all\");\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap has already been finalized\");\r\n\t\trequire(sha256(preimage) == paymentHash, \"Preimage doesn't match the payment hash\");\r\n\t\tOperator storage operator = operators[msg.sender];\r\n\t\toperator.tBTCBalance += swap.tBTCAmount;\r\n\t\tswap.tBTCAmount = 0;\r\n\t\t// The call to removeFees can overflow/underflow\r\n\t\t// But given that this can only happen if the operator assigns malicious fee parameters and\r\n\t\t// the result only affects `lnBalance`, which is unverified and can be already set to any value by the operator\r\n\t\t// then an overflow here won't cause any problems\r\n\t\toperator.lnBalance -= removeFees(swap.tBTCAmount/tBTCDenominator, operator.linearFee, operator.constantFee); \r\n\t}\r\n\r\n\t// The calculations done in this function may overflow or underflow\r\n\t// Extra care must be taken to ensure that the results from this function are only used in situations where this is fine\r\n\tfunction removeFees(uint amount, uint linearFee, uint constantFee) pure public returns (uint amountWithoutFees){\r\n\t\treturn ((amount - constantFee)*linearFeeDenominator)/(linearFeeDenominator+linearFee);\r\n\t}\r\n\r\n\t// ---------------------------------------------------------------\r\n\t// LN -> tBTC SWAPS\r\n\t// ---------------------------------------------------------------\r\n\r\n\t// A security deposit that is provided by the user on swap creation\r\n\t// It is returned to the user if either the swap concludes successfully or the operator is unresponsive and times out\r\n\t// If the user doesn't reveal the pre-image on time after the operator has locked tBTC, then it is awarded to the provider\r\n\t// Currently it is a simple constant value in ETH, which is not perfect for the following reasons:\r\n\t//   - This deposit should cover the operator's tx fees, but these are dynamic whereas the deposit is constant so it's possible\r\n\t//     that at some point tx fees are greater than this deposit\r\n\t//   - The deposit doesn't scale with the value of locked tBTC, so it's possible to make an operator lock a large amount of value\r\n\t//     while only losing a much smaller fee\r\n\t// However, doing something more complex would require an oracle, and, as it is, maintaining this kind of attack for a day\r\n\t// would cost 24 ETH, which is unsutainable, so the current system should already do a good job at deterring malicious actors\r\n\t// Furthemore, operators can defend against this attack by being selective on the swaps they allow (eg: they can reject big amounts)\r\n\tuint public securityDepositAmount = 1 ether;\r\n\r\n\tstruct LN2TBTCSwap {\r\n\t\t// Provider that is serving the swap\r\n\t\taddress provider;\r\n\t\t// Amount of tBTC that the user is requesting for their LN-bound BTC\r\n\t\t// It will locked in the contract by the operator after the user has sent an invoice payment request\r\n\t\t// A value of 0 is used to represent that the swap has been finalized\r\n\t\tuint tBTCAmount;\r\n\t\t// Timestamp of the moment the swap was created.\r\n\t\t// Always set to `now` on creation\r\n\t\t// This field is also used to check for struct existence by comparing it against 0\r\n\t\tuint startTimestamp;\r\n\t\t// Timestamp of the moment the operator locks it's tBTC tokens (after the user has sent the LN payment request)\r\n\t\t// Will be used to keep track of the timeout that is triggered when the user hasn't revealed the pre-image on time\r\n\t\tuint tBTCLockTimestamp;\r\n\t}\r\n\r\n\t// The reasons why this structure has been chosen are outlined in the definition of `tbtcSwaps`\r\n\tmapping (address => mapping (bytes32 => LN2TBTCSwap)) public lnSwaps;\r\n\r\n\t// Fired on swap creation, should be answered by the operator by providing the user with an LN invoice\r\n\tevent LN2TBTCSwapCreated(address userAddress, bytes32 paymentHash, address providerAddress, uint tBTCAmount);\r\n\t// Fired when the operator locks tBTC in expectance of the pre-image reveal, should be answered by the user with a call to `claimTBTCPayment`\r\n\tevent LN2TBTCOperatorLockedTBTC(address userAddress, bytes32 paymentHash);\r\n\t// Fired when the HTLC pre-image has been revealed, concludes the swap as the operator can now claim the LN payment and finalize everything\r\n\tevent LN2TBTCPreimageRevealed(address userAddress, bytes32 paymentHash, address providerAddress, bytes preimage);\r\n\r\n\t// Creates a new LN -> tBTC swap\r\n\t// Locks the ETH security deposit in the contract\r\n\t// This function doesn't reduce the `lnBalance` of an operator, see the comment on the definition of `createTBTC2LNSwap` for more details on this\r\n\tfunction createLN2TBTCSwap(bytes32 paymentHash, address providerAddress, uint tBTCAmount) payable public {\r\n\t\trequire(lnSwaps[msg.sender][paymentHash].startTimestamp == 0, \"Swap already exists\");\r\n\t\trequire(msg.value == securityDepositAmount, \"ETH security deposit provided isn't the right amount (should be 1 ETH)\");\r\n\t\trequire(tBTCAmount > 0, \"The amount requested cannot be zero (why swap something for nothing?)\");\r\n\t\tlnSwaps[msg.sender][paymentHash] = LN2TBTCSwap(providerAddress, tBTCAmount, now, 0);\r\n\t\temit LN2TBTCSwapCreated(msg.sender, paymentHash, providerAddress, tBTCAmount);\r\n\t}\r\n\r\n\t// Abort swap if the operator has been unresponsive and hasn't locked the tBTC tokens before the timeout (or the user hasn't sent a payment request)\r\n\t// Returns the security deposit to the user\r\n\tfunction revertLN2TBTCSwap(bytes32 paymentHash) public {\r\n\t\tLN2TBTCSwap storage swap = lnSwaps[msg.sender][paymentHash];\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap doesn't exist or has already been finalized\");\r\n\t\trequire((swap.startTimestamp + timeoutPeriod) < now, \"Swap hasn't timed out yet\");\r\n\t\trequire(swap.tBTCLockTimestamp == 0, \"Operator has locked the tBTC tokens before the timeout\");\r\n\t\tswap.tBTCAmount = 0;\r\n\t\tmsg.sender.transfer(securityDepositAmount); // Return security deposit\r\n\t}\r\n\r\n\t// Lock tBTC tokens and make them claimable by the user if they provide a valid pre-image before timeout\r\n\tfunction operatorLockTBTCForLN2TBTCSwap(address userAddress, bytes32 paymentHash) public {\r\n\t\tLN2TBTCSwap storage swap = lnSwaps[userAddress][paymentHash];\r\n\t\trequire(swap.provider == msg.sender, \"Swap doesn't use this provider or doesn't exist at all\");\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap has already been finalized\");\r\n\t\trequire(swap.tBTCLockTimestamp == 0, \"tBTC tokens have already been locked before for this swap\");\r\n\t\tOperator storage op = operators[msg.sender];\r\n\t\trequire(op.tBTCBalance >= swap.tBTCAmount, \"Operator doesn't have enough funds to conduct the swap\");\r\n\t\top.tBTCBalance -= swap.tBTCAmount;\r\n\t\tswap.tBTCLockTimestamp = now;\r\n\t\temit LN2TBTCOperatorLockedTBTC(userAddress, paymentHash);\r\n\t}\r\n\r\n\t// Revert swap if, once the operator has locked the tBTC tokens, the user hasn't revealed the pre-image before timeout\r\n\t// It will also transfer the security deposit provided by the user on swap creation to the operator, in order to:\r\n\t//   - Make up for the fees that the operator spent sending the transaction that called `operatorLockTBTCForLN2TBTCSwap`\r\n\t//   - Make up for the opportunity cost on the operator's side of having their tBTC locked for some time\r\n\tfunction operatorRevertLN2TBTCSwap(address userAddress, bytes32 paymentHash) public {\r\n\t\tLN2TBTCSwap storage swap = lnSwaps[userAddress][paymentHash];\r\n\t\trequire(swap.provider == msg.sender, \"Swap doesn't use this provider or doesn't exist at all\");\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap has already been finalized\");\r\n\t\trequire(swap.tBTCLockTimestamp != 0, \"tBTC tokens have not been locked for this swap\");\r\n\t\trequire((swap.tBTCLockTimestamp + timeoutPeriod) < now, \"Swap hasn't timed out yet\");\r\n\t\toperators[msg.sender].tBTCBalance += swap.tBTCAmount;\r\n\t\tswap.tBTCAmount = 0;\r\n\t\tmsg.sender.transfer(securityDepositAmount); // Award security deposit to the operator as compensation\r\n\t}\r\n\r\n\t// Claim the tBTC tokens locked by the operator, revealing the HTLC preimage and thus allowing the operator to finalise the LN payment\r\n\tfunction claimTBTCPayment(bytes32 paymentHash, bytes memory preimage) public {\r\n\t\tLN2TBTCSwap storage swap = lnSwaps[msg.sender][paymentHash];\r\n\t\trequire(swap.tBTCAmount > 0, \"Swap doesn't exist or has already been finalized\");\r\n\t\trequire(swap.tBTCLockTimestamp != 0, \"tBTC tokens have not been locked for this swap\");\r\n\t\trequire(sha256(preimage) == paymentHash, \"Preimage doesn't match the payment hash\");\r\n\t\tuint tBTCAmount = swap.tBTCAmount;\r\n\t\tswap.tBTCAmount = 0;\r\n\t\ttBTContract.transfer(msg.sender, tBTCAmount);\r\n\t\tmsg.sender.transfer(securityDepositAmount); // Return security deposit to user\r\n\t\tOperator storage op = operators[swap.provider];\r\n\t\t// The result of `addFees` must not be trusted as it can overflow/underflow. However, given that here we are\r\n\t\t// using it to set the value of `Operator.lnBalance`, which is already under the control of the operator, it's fine.\r\n\t\top.lnBalance += addFees(tBTCAmount/tBTCDenominator, op.linearFee, op.constantFee); // Update operator balance\r\n\t\temit LN2TBTCPreimageRevealed(msg.sender, paymentHash, swap.provider, preimage);\r\n\t}\r\n\r\n\t// The calculations done in this function may overflow or underflow\r\n\t// Extra care must be taken to ensure that the results from this function are only used in situations where this is fine\r\n\tfunction addFees(uint amount, uint linearFee, uint constantFee) pure public returns (uint amountWithFees){\r\n\t\treturn (amount * (linearFeeDenominator + linearFee))/linearFeeDenominator + constantFee;\r\n\t}\r\n}","ABI":"[{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"}],\"name\":\"LN2TBTCOperatorLockedTBTC\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"providerAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"bytes\",\"name\":\"preimage\",\"type\":\"bytes\"}],\"name\":\"LN2TBTCPreimageRevealed\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"providerAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"tBTCAmount\",\"type\":\"uint256\"}],\"name\":\"LN2TBTCSwapCreated\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":false,\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"providerAddress\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"lockTime\",\"type\":\"uint256\"},{\"indexed\":false,\"internalType\":\"string\",\"name\":\"invoice\",\"type\":\"string\"}],\"name\":\"TBTC2LNSwapCreated\",\"type\":\"event\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"linearFee\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"constantFee\",\"type\":\"uint256\"}],\"name\":\"addFees\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"amountWithFees\",\"type\":\"uint256\"}],\"stateMutability\":\"pure\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"internalType\":\"bytes\",\"name\":\"preimage\",\"type\":\"bytes\"}],\"name\":\"claimTBTCPayment\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"internalType\":\"address\",\"name\":\"providerAddress\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"tBTCAmount\",\"type\":\"uint256\"}],\"name\":\"createLN2TBTCSwap\",\"outputs\":[],\"stateMutability\":\"payable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"},{\"internalType\":\"address\",\"name\":\"providerAddress\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"lockTime\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"invoice\",\"type\":\"string\"}],\"name\":\"createTBTC2LNSwap\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"getOperatorListLength\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"length\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"},{\"internalType\":\"bytes32\",\"name\":\"\",\"type\":\"bytes32\"}],\"name\":\"lnSwaps\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"provider\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"tBTCAmount\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"startTimestamp\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"tBTCLockTimestamp\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"},{\"internalType\":\"bytes\",\"name\":\"preimage\",\"type\":\"bytes\"}],\"name\":\"operatorClaimPayment\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"operatorDepositTBTC\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"operatorList\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"}],\"name\":\"operatorLockTBTCForLN2TBTCSwap\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"tBTCBalance\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"lnBalance\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"linearFee\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"constantFee\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"publicUrl\",\"type\":\"string\"}],\"name\":\"operatorRegister\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"}],\"name\":\"operatorRevertLN2TBTCSwap\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"newLinearFee\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"newConstantFee\",\"type\":\"uint256\"}],\"name\":\"operatorSetFees\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"newLNBalance\",\"type\":\"uint256\"}],\"name\":\"operatorSetLNBalance\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"string\",\"name\":\"newUrl\",\"type\":\"string\"}],\"name\":\"operatorSetPublicUrl\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"operatorWithdrawTBTC\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"name\":\"operators\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"publicUrl\",\"type\":\"string\"},{\"internalType\":\"uint256\",\"name\":\"tBTCBalance\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"lnBalance\",\"type\":\"uint256\"},{\"internalType\":\"bool\",\"name\":\"exists\",\"type\":\"bool\"},{\"internalType\":\"uint256\",\"name\":\"linearFee\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"constantFee\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"linearFee\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"constantFee\",\"type\":\"uint256\"}],\"name\":\"removeFees\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"amountWithoutFees\",\"type\":\"uint256\"}],\"stateMutability\":\"pure\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"}],\"name\":\"revertLN2TBTCSwap\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bytes32\",\"name\":\"paymentHash\",\"type\":\"bytes32\"}],\"name\":\"revertTBTC2LNSwap\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"securityDepositAmount\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"},{\"internalType\":\"bytes32\",\"name\":\"\",\"type\":\"bytes32\"}],\"name\":\"tbtcSwaps\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"provider\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"tBTCAmount\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"timeoutTimestamp\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"timeoutPeriod\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]","ContractName":"LN2tBTC","CompilerVersion":"v0.6.6+commit.6c089d02","OptimizationUsed":"0","Runs":"200","ConstructorArguments":"","EVMVersion":"Default","Library":"","LicenseType":"MIT","Proxy":"0","Implementation":"","SwarmSource":"ipfs://4093075798cd01ddde8cda6cf89934e490b7d655e0750ca4aa2bcfb566691e1d"}]}